-------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/chenxinlei/Library/Mobile Documents/com~apple~CloudDocs/Projects/AKI/Code/VMI
> /VMI.log
  log type:  text
 opened on:   5 Oct 2024, 17:19:43

. 
. use "/Users/chenxinlei/Library/Mobile Documents/com~apple~CloudDocs/Projects/AKI/Data/VMI/VMI_C
> omplete_Data.dta", clear

. 
. /*
> Descriptive analysis: 
> */
. * 1. The association between total HS and PBR 5-25
. foreach var of varlist total_HS PBR5_25 X__24_hours_Total_Fluids Age_At_Enrollment APACHEIII_ba
> seline Charlson IL6Val ref_Creatinine {
  2.     egen z_`var' = std(`var')
  3. }
(33 missing values generated)

. mixed z_PBR5_25 z_total_HS i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_AP
> ACHEIII_baseline z_Charlson z_ref_Creatinine|| PatientID: , variance

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -110.93272  
Iteration 1:  Log likelihood = -110.93243  
Iteration 2:  Log likelihood = -110.93243  

Computing standard errors ...

Mixed-effects ML regression                          Number of obs    =     97
Group variable: PatientID                            Number of groups =     59
                                                     Obs per group:
                                                                  min =      1
                                                                  avg =    1.6
                                                                  max =      3
                                                     Wald chi2(9)     =  29.46
Log likelihood = -110.93243                          Prob > chi2      = 0.0005

--------------------------------------------------------------------------------------------
                 z_PBR5_25 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                z_total_HS |  -.0115579    .082498    -0.14   0.889     -.173251    .1501353
                           |
                      hour |
                       24  |  -.2447849   .1613881    -1.52   0.129    -.5610998    .0715299
                       72  |   .0395993   .1346726     0.29   0.769    -.2243542    .3035528
                           |
z_X__24_hours_Total_Fluids |    .202438   .1082231     1.87   0.061    -.0096755    .4145514
       z_Age_At_Enrollment |  -.1059597   .1277732    -0.83   0.407    -.3563905    .1444712
                 2.Sex_Scr |   .5440011   .2389541     2.28   0.023     .0756598    1.012342
      z_APACHEIII_baseline |  -.0832737   .1113105    -0.75   0.454    -.3014382    .1348909
                z_Charlson |   .5022379   .1157094     4.34   0.000     .2754517    .7290241
          z_ref_Creatinine |  -.0675185   .1076356    -0.63   0.530    -.2784805    .1434435
                     _cons |  -.1802599   .1615951    -1.12   0.265    -.4969804    .1364607
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
PatientID: Identity          |
                  var(_cons) |     .50274   .1407196      .2904609    .8701602
-----------------------------+------------------------------------------------
               var(Residual) |   .2414845   .0595965      .1488742    .3917051
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 17.54         Prob >= chibar2 = 0.0000

. 
. * 2. Comparison of markers of glycocalyx denudation, microvascular dysfunction, platelet count 
> and inflammation in the following groups: without AKI, with AKI, and within the AKI patients, t
> hose with transient AKI, persistent severe AKI and AKD. 
. 
. /*
> 1. Primary analysis
> Hypothesis: Glycocalyx denudation is associated with higher risk of persistent severe AKI. 
> */
. use "/Users/chenxinlei/Library/Mobile Documents/com~apple~CloudDocs/Projects/AKI/Data/VMI/VMI_C
> omplete_Data.dta", clear

. foreach var of varlist total_HS PBR5_25 X__24_hours_Total_Fluids Age_At_Enrollment APACHEIII_ba
> seline Charlson IL6Val ref_Creatinine {
  2.     egen z_`var' = std(`var')
  3. }
(33 missing values generated)

. 
. * Check the correlation of the data
. corr z_total_HS z_PBR5_25 z_X__24_hours_Total_Fluids z_Age_At_Enrollment z_APACHEIII_baseline z
> _Charlson z_IL6Val z_ref_Creatinine
(obs=64)

             | z_tota~S z_PBR~25 z_X__2~s z_Age_~t z_APAC~e z_Char~n z_IL6Val z_ref_~e
-------------+------------------------------------------------------------------------
  z_total_HS |   1.0000
   z_PBR5_25 |   0.3092   1.0000
z_X__24_ho~s |   0.1575   0.2700   1.0000
z_Age_At_E~t |   0.0708  -0.1139  -0.1467   1.0000
z_APACHEII~e |   0.1552   0.0038   0.0197   0.4418   1.0000
  z_Charlson |   0.2851   0.2621  -0.0568   0.2504   0.3060   1.0000
    z_IL6Val |   0.2328   0.0451   0.0847  -0.0108   0.3278  -0.1244   1.0000
z_ref_Crea~e |   0.1595  -0.0179  -0.0186   0.1777  -0.0082   0.1558   0.0470   1.0000


. 
. ** AKI vs No AKI
. logit AKI z_total_HS i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_APACHEII
> I_baseline z_Charlson z_ref_Creatinine, vce(robust) or

Iteration 0:  Log pseudolikelihood = -63.976977  
Iteration 1:  Log pseudolikelihood = -53.793617  
Iteration 2:  Log pseudolikelihood = -53.321493  
Iteration 3:  Log pseudolikelihood = -53.318466  
Iteration 4:  Log pseudolikelihood = -53.318466  

Logistic regression                                     Number of obs =     97
                                                        Wald chi2(9)  =  12.34
                                                        Prob > chi2   = 0.1950
Log pseudolikelihood = -53.318466                       Pseudo R2     = 0.1666

--------------------------------------------------------------------------------------------
                           |               Robust
                       AKI | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                z_total_HS |   .7641659   .2090023    -0.98   0.325     .4470755    1.306154
                           |
                      hour |
                       24  |   .9575737   .6618001    -0.06   0.950     .2471088    3.710703
                       72  |   .8280675   .4371639    -0.36   0.721     .2942311    2.330466
                           |
z_X__24_hours_Total_Fluids |   1.511274   .3882677     1.61   0.108     .9133922    2.500512
       z_Age_At_Enrollment |   .6593376   .2099483    -1.31   0.191     .3532365    1.230694
                 2.Sex_Scr |     .19979   .1205372    -2.67   0.008     .0612389    .6518087
      z_APACHEIII_baseline |   2.198155   .8039874     2.15   0.031     1.073313    4.501839
                z_Charlson |    .630475   .1656268    -1.76   0.079     .3767522    1.055067
          z_ref_Creatinine |   2.004251   .7129741     1.95   0.051     .9980529    4.024861
                     _cons |   4.701277   2.352004     3.09   0.002     1.763469    12.53325
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for AKI

Number of observations =       97
Area under ROC curve   =   0.7691

. 
. logit AKI z_PBR5_25 i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_APACHEIII
> _baseline z_Charlson z_ref_Creatinine, vce(robust) or

Iteration 0:  Log pseudolikelihood = -63.976977  
Iteration 1:  Log pseudolikelihood = -53.319227  
Iteration 2:  Log pseudolikelihood = -52.893978  
Iteration 3:  Log pseudolikelihood = -52.892791  
Iteration 4:  Log pseudolikelihood = -52.892791  

Logistic regression                                     Number of obs =     97
                                                        Wald chi2(9)  =  13.42
                                                        Prob > chi2   = 0.1447
Log pseudolikelihood = -52.892791                       Pseudo R2     = 0.1733

--------------------------------------------------------------------------------------------
                           |               Robust
                       AKI | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                 z_PBR5_25 |   .6868848    .185518    -1.39   0.164     .4045631    1.166223
                           |
                      hour |
                       24  |   .7967517   .5648236    -0.32   0.749     .1985635    3.197029
                       72  |   .8840111   .4665909    -0.23   0.815      .314184    2.487318
                           |
z_X__24_hours_Total_Fluids |   1.598432     .41354     1.81   0.070     .9626638    2.654078
       z_Age_At_Enrollment |   .6309833    .206261    -1.41   0.159     .3324835    1.197473
                 2.Sex_Scr |    .228221   .1373692    -2.45   0.014     .0701465    .7425144
      z_APACHEIII_baseline |   2.071009   .7302073     2.06   0.039     1.037674    4.133359
                z_Charlson |   .7105485   .1986708    -1.22   0.222     .4107675    1.229112
          z_ref_Creatinine |   1.715087   .4640697     1.99   0.046     1.009177    2.914775
                     _cons |   4.463562   2.169554     3.08   0.002      1.72166    11.57219
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for AKI

Number of observations =       97
Area under ROC curve   =   0.7705

. 
. ** Persistent severe AKI vs No Persistent Severe AKI
. keep if AKI == 1
(36 observations deleted)

. 
. * Check the correlation of the data
. corr z_total_HS z_PBR5_25 z_X__24_hours_Total_Fluids z_Age_At_Enrollment z_APACHEIII_baseline z
> _Charlson z_IL6Val z_ref_Creatinine Persistent_Severe_AKI Sex_Scr
(obs=41)

             | z_tota~S z_PBR~25 z_X__2~s z_Age_~t z_APAC~e z_Char~n z_IL6Val z_ref_~e Persis~I
-------------+---------------------------------------------------------------------------------
  z_total_HS |   1.0000
   z_PBR5_25 |   0.3266   1.0000
z_X__24_ho~s |   0.2879   0.5131   1.0000
z_Age_At_E~t |  -0.0458  -0.1726  -0.1787   1.0000
z_APACHEII~e |   0.0745  -0.0114   0.0669   0.4907   1.0000
  z_Charlson |   0.4293   0.2894   0.1033   0.2869   0.3037   1.0000
    z_IL6Val |  -0.0870  -0.0044   0.0830  -0.0282   0.3066  -0.1855   1.0000
z_ref_Crea~e |   0.3653   0.0675  -0.0703   0.2282   0.0802   0.2178   0.0648   1.0000
Persistent~I |   0.2875   0.2278   0.3953   0.1806   0.6384   0.0367   0.2085   0.3248   1.0000
     Sex_Scr |   0.0030   0.1863   0.2658  -0.4351  -0.0102  -0.2636   0.1524   0.0290   0.1145

             |  Sex_Scr
-------------+---------
     Sex_Scr |   1.0000


. 
. logit Persistent_Severe_AKI z_total_HS i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.
> Sex_Scr z_APACHEIII_baseline z_Charlson z_ref_Creatinine, vce(robust) or

note: 72.hour != 0 predicts failure perfectly;
      72.hour omitted and 14 obs not used.

Iteration 0:  Log pseudolikelihood = -19.780388  
Iteration 1:  Log pseudolikelihood = -9.1397118  
Iteration 2:  Log pseudolikelihood = -6.4231855  
Iteration 3:  Log pseudolikelihood = -5.7255944  
Iteration 4:  Log pseudolikelihood = -5.5551297  
Iteration 5:  Log pseudolikelihood = -5.5487789  
Iteration 6:  Log pseudolikelihood = -5.5487568  
Iteration 7:  Log pseudolikelihood = -5.5487568  

Logistic regression                                     Number of obs =     47
                                                        Wald chi2(8)  =  16.12
                                                        Prob > chi2   = 0.0407
Log pseudolikelihood = -5.5487568                       Pseudo R2     = 0.7195

--------------------------------------------------------------------------------------------
                           |               Robust
     Persistent_Severe_AKI | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                z_total_HS |   4.798392   6.773709     1.11   0.267     .3016384    76.33169
                           |
                      hour |
                       24  |   1.145884   1.303959     0.12   0.905     .1231732     10.6602
                       72  |          1  (empty)
                           |
z_X__24_hours_Total_Fluids |   13.87826   21.74297     1.68   0.093     .6438194    299.1619
       z_Age_At_Enrollment |   13.10003    45.5435     0.74   0.459     .0143876    11927.65
                 2.Sex_Scr |   2.087667    5.92795     0.26   0.795     .0079922    545.3264
      z_APACHEIII_baseline |   10.11429   8.462598     2.77   0.006     1.962173    52.13548
                z_Charlson |   1.372652   .8777074     0.50   0.620     .3919955    4.806618
          z_ref_Creatinine |   1.200021   .7047908     0.31   0.756     .3795468    3.794134
                     _cons |   .0004812   .0026236    -1.40   0.161     1.10e-08    21.05544
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
Note: 1 failure and 0 successes completely determined.

. estat auc

Logistic model for Persistent_Severe_AKI

Number of observations =       47
Area under ROC curve   =   0.9821

. 
. logit Persistent_Severe_AKI z_PBR5_25 i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.S
> ex_Scr z_APACHEIII_baseline z_Charlson z_ref_Creatinine, vce(robust) or

note: 72.hour != 0 predicts failure perfectly;
      72.hour omitted and 14 obs not used.

Iteration 0:  Log pseudolikelihood = -19.780388  
Iteration 1:  Log pseudolikelihood = -9.3241246  
Iteration 2:  Log pseudolikelihood = -6.7375235  
Iteration 3:  Log pseudolikelihood = -6.2818623  
Iteration 4:  Log pseudolikelihood = -6.2461169  
Iteration 5:  Log pseudolikelihood = -6.2457582  
Iteration 6:  Log pseudolikelihood = -6.2457582  

Logistic regression                                     Number of obs =     47
                                                        Wald chi2(8)  =  28.30
                                                        Prob > chi2   = 0.0004
Log pseudolikelihood = -6.2457582                       Pseudo R2     = 0.6842

--------------------------------------------------------------------------------------------
                           |               Robust
     Persistent_Severe_AKI | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                 z_PBR5_25 |   .8152794   .5507292    -0.30   0.762     .2169259    3.064089
                           |
                      hour |
                       24  |   3.822748   7.420904     0.69   0.490     .0851102    171.6997
                       72  |          1  (empty)
                           |
z_X__24_hours_Total_Fluids |   7.383378   4.847793     3.04   0.002     2.038785     26.7386
       z_Age_At_Enrollment |   1.553544   2.295593     0.30   0.766     .0858116    28.12555
                 2.Sex_Scr |   .3015857    .513792    -0.70   0.482     .0106973    8.502517
      z_APACHEIII_baseline |   9.043746   5.500237     3.62   0.000     2.745767    29.78744
                z_Charlson |   .7608666   .4741193    -0.44   0.661     .2243359    2.580586
          z_ref_Creatinine |   3.285698   2.073861     1.88   0.059     .9536033    11.32107
                     _cons |   .0042238   .0090139    -2.56   0.010     .0000644    .2768288
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for Persistent_Severe_AKI

Number of observations =       47
Area under ROC curve   =   0.9821

. 
. ** Persistent Severe AKI vs No AKI
. use "/Users/chenxinlei/Library/Mobile Documents/com~apple~CloudDocs/Projects/AKI/Data/VMI/VMI_C
> omplete_Data.dta", clear

. 
. gen Persistent_Severe_AKI_vs_No_AKI = .
(97 missing values generated)

. replace Persistent_Severe_AKI_vs_No_AKI = 0 if AKI == 0
(36 real changes made)

. replace Persistent_Severe_AKI_vs_No_AKI = 1 if Persistent_Severe_AKI == 1
(7 real changes made)

. keep if !missing(Persistent_Severe_AKI_vs_No_AKI)
(54 observations deleted)

. 
. foreach var of varlist total_HS PBR5_25 X__24_hours_Total_Fluids Age_At_Enrollment APACHEIII_ba
> seline Charlson IL6Val ref_Creatinine {
  2.     egen z_`var' = std(`var')
  3. }
(17 missing values generated)

. 
. logit Persistent_Severe_AKI_vs_No_AKI total_HS i.hour X__24_hours_Total_Fluids Age_At_Enrollmen
> t i.Sex_Scr Charlson ref_Creatinine, vce(robust) or

note: 72.hour != 0 predicts failure perfectly;
      72.hour omitted and 12 obs not used.

Iteration 0:  Log pseudolikelihood =  -16.55894  
Iteration 1:  Log pseudolikelihood = -9.2460315  
Iteration 2:  Log pseudolikelihood = -6.2561535  
Iteration 3:  Log pseudolikelihood = -5.1905149  
Iteration 4:  Log pseudolikelihood = -5.0807441  
Iteration 5:  Log pseudolikelihood = -5.0769623  
Iteration 6:  Log pseudolikelihood = -5.0769582  
Iteration 7:  Log pseudolikelihood = -5.0769582  

Logistic regression                                     Number of obs =     31
                                                        Wald chi2(7)  =   7.67
                                                        Prob > chi2   = 0.3621
Log pseudolikelihood = -5.0769582                       Pseudo R2     = 0.6934

------------------------------------------------------------------------------------------------
                               |               Robust
Persistent_Severe_AKI_vs_No_~I | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------------------------+----------------------------------------------------------------
                      total_HS |   1.002957   .0016663     1.78   0.076     .9996966    1.006228
                               |
                          hour |
                           24  |   .0049151   .0217591    -1.20   0.230     8.38e-07    28.82541
                           72  |          1  (empty)
                               |
      X__24_hours_Total_Fluids |    1.00342   .0021104     1.62   0.105     .9992924    1.007565
             Age_At_Enrollment |   1.189227   .1639856     1.26   0.209     .9075912    1.558257
                     2.Sex_Scr |   .0190667   .0711018    -1.06   0.288     .0000128      28.477
                      Charlson |   2.124162   1.463552     1.09   0.274     .5504375    8.197232
                ref_Creatinine |   .2187558   .5525504    -0.60   0.547     .0015486    30.90229
                         _cons |   1.18e-11   1.91e-10    -1.56   0.118     2.34e-25    600.7536
------------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
Note: 5 failures and 0 successes completely determined.

. estat auc

Logistic model for Persistent_Severe_AKI_vs_No_AKI

Number of observations =       31
Area under ROC curve   =   0.9762

. 
. logit Persistent_Severe_AKI_vs_No_AKI PBR5_25 i.hour X__24_hours_Total_Fluids Age_At_Enrollment
>  i.Sex_Scr Charlson ref_Creatinine, vce(robust) or

note: 72.hour != 0 predicts failure perfectly;
      72.hour omitted and 12 obs not used.

Iteration 0:  Log pseudolikelihood =  -16.55894  
Iteration 1:  Log pseudolikelihood = -9.6716927  
Iteration 2:  Log pseudolikelihood = -7.4137031  
Iteration 3:  Log pseudolikelihood = -6.6543996  
Iteration 4:  Log pseudolikelihood = -6.5774863  
Iteration 5:  Log pseudolikelihood = -6.5758325  
Iteration 6:  Log pseudolikelihood =   -6.57583  
Iteration 7:  Log pseudolikelihood =   -6.57583  

Logistic regression                                     Number of obs =     31
                                                        Wald chi2(7)  =   9.50
                                                        Prob > chi2   = 0.2188
Log pseudolikelihood = -6.57583                         Pseudo R2     = 0.6029

------------------------------------------------------------------------------------------------
                               |               Robust
Persistent_Severe_AKI_vs_No_~I | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------------------------+----------------------------------------------------------------
                       PBR5_25 |   .4343898   1.114214    -0.33   0.745      .002848    66.25512
                               |
                          hour |
                           24  |   .0968507   .2176258    -1.04   0.299     .0011842    7.920875
                           72  |          1  (empty)
                               |
      X__24_hours_Total_Fluids |   1.002185   .0010534     2.08   0.038     1.000123    1.004252
             Age_At_Enrollment |   1.077454   .0724583     1.11   0.267     .9443999    1.229255
                     2.Sex_Scr |   .0187339   .0654939    -1.14   0.255     .0000198    17.71882
                      Charlson |   1.381879    .546003     0.82   0.413     .6370103    2.997738
                ref_Creatinine |   2.493246   4.557854     0.50   0.617     .0692948    89.70771
                         _cons |   3.56e-06   .0000253    -1.76   0.078     3.12e-12    4.063435
------------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for Persistent_Severe_AKI_vs_No_AKI

Number of observations =       31
Area under ROC curve   =   0.9583

. 
. 
. /*
> 2. Secondary clinical analyses
> A. Hypothesis: The change in glycocalyx denudation (72h â€“ 6h/24h - 6h) is associated with highe
> r risk of persistent severe AKI. 
> */
. use "/Users/chenxinlei/Library/Mobile Documents/com~apple~CloudDocs/Projects/AKI/Data/VMI/VMI_C
> omplete_Data.dta", clear

. keep PatientID hour AKI Persistent_Severe_AKI total_HS PBR5_25 X__24_hours_Total_Fluids Age_At_
> Enrollment Sex_Scr APACHEIII_baseline Charlson IL6Val ref_Creatinine

. reshape wide total_HS PBR5_25 IL6Val, i(PatientID) j(hour)
(j = 6 24 72)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations               97   ->   59          
Number of variables                  13   ->   18          
j variable (3 values)              hour   ->   (dropped)
xij variables:
                               total_HS   ->   total_HS6 total_HS24 total_HS72
                                PBR5_25   ->   PBR5_256 PBR5_2524 PBR5_2572
                                 IL6Val   ->   IL6Val6 IL6Val24 IL6Val72
-----------------------------------------------------------------------------

. 
. gen total_HS_diff_72_6 = total_HS72 - total_HS6
(36 missing values generated)

. gen PBR5_25_diff_72_6 = PBR5_2572 - PBR5_256
(36 missing values generated)

. gen total_HS_diff_24_6 = total_HS24 - total_HS6
(44 missing values generated)

. gen PBR5_25_diff_24_6 = PBR5_2524 - PBR5_256
(44 missing values generated)

. 
. gen total_HS_diff = total_HS_diff_72_6
(36 missing values generated)

. replace total_HS_diff = total_HS_diff_24_6 if missing(total_HS_diff)
(6 real changes made)

. gen PBR5_25_diff = PBR5_25_diff_72_6
(36 missing values generated)

. replace PBR5_25_diff = PBR5_25_diff_24_6 if missing(PBR5_25_diff)
(6 real changes made)

. 
. foreach var of varlist total_HS_diff PBR5_25_diff X__24_hours_Total_Fluids Age_At_Enrollment AP
> ACHEIII_baseline Charlson IL6Val6 ref_Creatinine {
  2.     egen z_`var' = std(`var')
  3. }
(30 missing values generated)
(30 missing values generated)
(18 missing values generated)

. 
. gen APACHEIII_baseline_log = log(APACHEIII_baseline)

. hist(APACHEIII_baseline_log)
(bin=7, start=3.2580965, width=.23210079)

. 
. egen z_APACHEIII_baseline_log = std(APACHEIII_baseline_log)

. hist(z_APACHEIII_baseline_log)
(bin=7, start=-2.4261143, width=.72208779)

. 
. gen ref_Creatinine_log = log(ref_Creatinine)

. egen z_ref_Creatinine_log = std(ref_Creatinine_log)

. 
. ** AKI vs No AKI
. logit AKI z_total_HS_diff z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_APACHEIII_
> baseline_log z_Charlson z_ref_Creatinine_log, vce(robust) or

Iteration 0:  Log pseudolikelihood = -19.945818  
Iteration 1:  Log pseudolikelihood = -16.315575  
Iteration 2:  Log pseudolikelihood = -16.276319  
Iteration 3:  Log pseudolikelihood = -16.276224  
Iteration 4:  Log pseudolikelihood = -16.276224  

Logistic regression                                     Number of obs =     29
                                                        Wald chi2(7)  =   4.66
                                                        Prob > chi2   = 0.7013
Log pseudolikelihood = -16.276224                       Pseudo R2     = 0.1840

--------------------------------------------------------------------------------------------
                           |               Robust
                       AKI | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
           z_total_HS_diff |   1.054912   .6823919     0.08   0.934      .296892    3.748295
z_X__24_hours_Total_Fluids |   1.405294   .6671709     0.72   0.474     .5541845    3.563524
       z_Age_At_Enrollment |   .5621795   .4614862    -0.70   0.483     .1124952    2.809415
                 2.Sex_Scr |   .3722401   .4360845    -0.84   0.399     .0374652    3.698433
  z_APACHEIII_baseline_log |   4.635378   4.677606     1.52   0.129     .6414003    33.49972
                z_Charlson |   .5162132   .3270471    -1.04   0.297     .1491248    1.786933
      z_ref_Creatinine_log |   2.725839   1.801307     1.52   0.129     .7464549     9.95398
                     _cons |   1.486177   1.198802     0.49   0.623     .3058167    7.222366
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for AKI

Number of observations =       29
Area under ROC curve   =   0.7933

. 
. logit AKI z_PBR5_25_diff z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_APACHEIII_b
> aseline_log z_Charlson z_ref_Creatinine_log, vce(robust) or

Iteration 0:  Log pseudolikelihood = -19.945818  
Iteration 1:  Log pseudolikelihood = -15.373549  
Iteration 2:  Log pseudolikelihood = -15.335938  
Iteration 3:  Log pseudolikelihood = -15.335871  
Iteration 4:  Log pseudolikelihood = -15.335871  

Logistic regression                                     Number of obs =     29
                                                        Wald chi2(7)  =   8.62
                                                        Prob > chi2   = 0.2808
Log pseudolikelihood = -15.335871                       Pseudo R2     = 0.2311

--------------------------------------------------------------------------------------------
                           |               Robust
                       AKI | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
            z_PBR5_25_diff |   .4893654   .2712319    -1.29   0.197     .1651402    1.450152
z_X__24_hours_Total_Fluids |   1.277829   .4900117     0.64   0.523     .6026439    2.709472
       z_Age_At_Enrollment |   .5064276   .3674343    -0.94   0.348     .1221617    2.099421
                 2.Sex_Scr |   .2627135   .3237012    -1.08   0.278     .0234789    2.939587
  z_APACHEIII_baseline_log |   6.124003   5.362288     2.07   0.038     1.100799    34.06928
                z_Charlson |   .5317951    .331163    -1.01   0.311       .15692     1.80223
      z_ref_Creatinine_log |   2.496322   1.561636     1.46   0.144     .7325047    8.507283
                     _cons |   1.740838   1.458758     0.66   0.508     .3368856    8.995683
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for AKI

Number of observations =       29
Area under ROC curve   =   0.7933

. 
. 
. /*
> B. Hypothesis: Glycocalyx denudation is associated with higher risk of no renal recovery. 
> Outcome: Renal recovery
> */
. use "/Users/chenxinlei/Library/Mobile Documents/com~apple~CloudDocs/Projects/AKI/Data/VMI/VMI_C
> omplete_Data.dta", clear

. foreach var of varlist total_HS PBR5_25 X__24_hours_Total_Fluids Age_At_Enrollment APACHEIII_ba
> seline Charlson IL6Val ref_Creatinine {
  2.     egen z_`var' = std(`var')
  3. }
(33 missing values generated)

. 
. logit AKI_Recovery_Total z_total_HS i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex
> _Scr z_APACHEIII_baseline z_Charlson z_ref_Creatinine, vce(robust) or

Iteration 0:  Log pseudolikelihood =  -66.98248  
Iteration 1:  Log pseudolikelihood = -59.148335  
Iteration 2:  Log pseudolikelihood = -59.015784  
Iteration 3:  Log pseudolikelihood = -59.015684  
Iteration 4:  Log pseudolikelihood = -59.015684  

Logistic regression                                     Number of obs =     97
                                                        Wald chi2(9)  =  12.08
                                                        Prob > chi2   = 0.2091
Log pseudolikelihood = -59.015684                       Pseudo R2     = 0.1189

--------------------------------------------------------------------------------------------
                           |               Robust
        AKI_Recovery_Total | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                z_total_HS |   .6479093   .1443421    -1.95   0.051     .4186802    1.002642
                           |
                      hour |
                       24  |   1.057854    .654568     0.09   0.928     .3145781    3.557324
                       72  |   1.870591    1.00517     1.17   0.244     .6525023    5.362604
                           |
z_X__24_hours_Total_Fluids |    .890421   .2361926    -0.44   0.662     .5294271    1.497562
       z_Age_At_Enrollment |   .6403073   .1815171    -1.57   0.116     .3673552    1.116068
                 2.Sex_Scr |   .2133879   .1160971    -2.84   0.005     .0734616    .6198397
      z_APACHEIII_baseline |   1.228068   .3143664     0.80   0.422     .7435801    2.028228
                z_Charlson |   .6067766   .1571448    -1.93   0.054     .3652432    1.008035
          z_ref_Creatinine |    1.84036   .4955507     2.27   0.023     1.085679     3.11964
                     _cons |    1.49238   .5675676     1.05   0.292     .7082047    3.144852
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for AKI_Recovery_Total

Number of observations =       97
Area under ROC curve   =   0.7222

. 
. logit AKI_Recovery_Total z_PBR5_25 i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_
> Scr z_APACHEIII_baseline z_Charlson z_ref_Creatinine, vce(robust) or

Iteration 0:  Log pseudolikelihood =  -66.98248  
Iteration 1:  Log pseudolikelihood = -58.123904  
Iteration 2:  Log pseudolikelihood = -58.083614  
Iteration 3:  Log pseudolikelihood = -58.083581  
Iteration 4:  Log pseudolikelihood = -58.083581  

Logistic regression                                     Number of obs =     97
                                                        Wald chi2(9)  =  11.74
                                                        Prob > chi2   = 0.2281
Log pseudolikelihood = -58.083581                       Pseudo R2     = 0.1329

--------------------------------------------------------------------------------------------
                           |               Robust
        AKI_Recovery_Total | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                 z_PBR5_25 |   .5648915   .1604756    -2.01   0.044     .3237083    .9857715
                           |
                      hour |
                       24  |   .7409181    .446927    -0.50   0.619     .2271535     2.41669
                       72  |   1.973111   1.080429     1.24   0.215     .6746115    5.770977
                           |
z_X__24_hours_Total_Fluids |   .9628336    .259946    -0.14   0.888     .5672098    1.634402
       z_Age_At_Enrollment |   .6097992   .1931986    -1.56   0.118     .3277225    1.134664
                 2.Sex_Scr |   .2880572   .1586914    -2.26   0.024     .0978475    .8480232
      z_APACHEIII_baseline |   1.152254   .2819731     0.58   0.563     .7132583    1.861441
                z_Charlson |   .7487922   .1992996    -1.09   0.277      .444431     1.26159
          z_ref_Creatinine |   1.525256   .3480922     1.85   0.064     .9751745    2.385629
                     _cons |   1.347826   .5072824     0.79   0.428     .6445643    2.818391
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for AKI_Recovery_Total

Number of observations =       97
Area under ROC curve   =   0.7598

. 
. 
. 
. /*
> C. Hypothesis: Glycocalyx denudation is associated with higher risk of MAKE 30.
> Outcome: MAKE 30/MAKE 30 v2
> */
. use "/Users/chenxinlei/Library/Mobile Documents/com~apple~CloudDocs/Projects/AKI/Data/VMI/VMI_C
> omplete_Data.dta", clear

. foreach var of varlist total_HS PBR5_25 X__24_hours_Total_Fluids Age_At_Enrollment APACHEIII_ba
> seline Charlson IL6Val ref_Creatinine {
  2.     egen z_`var' = std(`var')
  3. }
(33 missing values generated)

. 
. 
. logit MAKE30 z_total_HS i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_APACH
> EIII_baseline z_Charlson z_ref_Creatinine, vce(robust) or

Iteration 0:  Log pseudolikelihood =  -50.67626  
Iteration 1:  Log pseudolikelihood =  -36.31299  
Iteration 2:  Log pseudolikelihood = -34.964794  
Iteration 3:  Log pseudolikelihood = -34.937854  
Iteration 4:  Log pseudolikelihood = -34.937805  
Iteration 5:  Log pseudolikelihood = -34.937805  

Logistic regression                                     Number of obs =     97
                                                        Wald chi2(9)  =  20.45
                                                        Prob > chi2   = 0.0153
Log pseudolikelihood = -34.937805                       Pseudo R2     = 0.3106

--------------------------------------------------------------------------------------------
                           |               Robust
                    MAKE30 | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                z_total_HS |   1.861586   .6458499     1.79   0.073     .9431289    3.674472
                           |
                      hour |
                       24  |    .601426    .481075    -0.64   0.525     .1254048    2.884365
                       72  |   .2237938   .1981214    -1.69   0.091     .0394722    1.268833
                           |
z_X__24_hours_Total_Fluids |   1.616594   .4046675     1.92   0.055     .9897545     2.64043
       z_Age_At_Enrollment |    .889743   .2835868    -0.37   0.714     .4763893    1.661755
                 2.Sex_Scr |   .9035086   .6755246    -0.14   0.892     .2086969    3.911547
      z_APACHEIII_baseline |   2.526703   .8900097     2.63   0.009     1.266852    5.039445
                z_Charlson |   1.486462    .374231     1.57   0.115      .907519    2.434736
          z_ref_Creatinine |   .8439204   .2091326    -0.68   0.493     .5192356    1.371635
                     _cons |   .2750458    .120246    -2.95   0.003     .1167541    .6479444
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for MAKE30

Number of observations =       97
Area under ROC curve   =   0.8277

. 
. 
. logit MAKE30 z_PBR5_25 i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_APACHE
> III_baseline z_Charlson z_ref_Creatinine, vce(robust) or

Iteration 0:  Log pseudolikelihood =  -50.67626  
Iteration 1:  Log pseudolikelihood = -36.667512  
Iteration 2:  Log pseudolikelihood = -35.134138  
Iteration 3:  Log pseudolikelihood = -35.103455  
Iteration 4:  Log pseudolikelihood = -35.103377  
Iteration 5:  Log pseudolikelihood = -35.103377  

Logistic regression                                     Number of obs =     97
                                                        Wald chi2(9)  =  18.94
                                                        Prob > chi2   = 0.0257
Log pseudolikelihood = -35.103377                       Pseudo R2     = 0.3073

--------------------------------------------------------------------------------------------
                           |               Robust
                    MAKE30 | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                 z_PBR5_25 |   2.190383   .7502243     2.29   0.022     1.119378    4.286113
                           |
                      hour |
                       24  |   .9812185   .7945221    -0.02   0.981     .2006884    4.797436
                       72  |   .1514249   .1420033    -2.01   0.044     .0240967    .9515625
                           |
z_X__24_hours_Total_Fluids |   1.431112   .3885287     1.32   0.187     .8405876    2.436486
       z_Age_At_Enrollment |   .9272061    .299453    -0.23   0.815     .4923455    1.746154
                 2.Sex_Scr |   .5942581   .4480458    -0.69   0.490     .1355828    2.604627
      z_APACHEIII_baseline |   3.145755   1.331425     2.71   0.007     1.372328    7.210939
                z_Charlson |   1.154667   .3304345     0.50   0.615     .6589703    2.023241
          z_ref_Creatinine |   1.076112    .253047     0.31   0.755     .6787312    1.706149
                     _cons |   .3351384   .1590441    -2.30   0.021     .1322136    .8495176
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for MAKE30

Number of observations =       97
Area under ROC curve   =   0.8390

. 
. 
. /*
> D. Hypothesis: Glycocalyx denudation is associated with higher risk of AKD.
> Outcome: AKD
> */
. 
. logit AKD z_total_HS i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_APACHEII
> I_baseline z_Charlson z_ref_Creatinine, vce(robust) or

note: 72.hour != 0 predicts failure perfectly;
      72.hour omitted and 26 obs not used.

Iteration 0:  Log pseudolikelihood = -32.256682  
Iteration 1:  Log pseudolikelihood = -21.354759  
Iteration 2:  Log pseudolikelihood = -18.416645  
Iteration 3:  Log pseudolikelihood = -18.034873  
Iteration 4:  Log pseudolikelihood = -18.028144  
Iteration 5:  Log pseudolikelihood = -18.028137  
Iteration 6:  Log pseudolikelihood = -18.028137  

Logistic regression                                     Number of obs =     71
                                                        Wald chi2(8)  =  10.56
                                                        Prob > chi2   = 0.2281
Log pseudolikelihood = -18.028137                       Pseudo R2     = 0.4411

--------------------------------------------------------------------------------------------
                           |               Robust
                       AKD | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                z_total_HS |   1.850122   .7321461     1.55   0.120     .8518355    4.018326
                           |
                      hour |
                       24  |   .4238952   .2820909    -1.29   0.197     .1150288    1.562106
                       72  |          1  (empty)
                           |
z_X__24_hours_Total_Fluids |   3.817648   2.100121     2.44   0.015     1.298801    11.22145
       z_Age_At_Enrollment |   1.330548   .4677399     0.81   0.417     .6680357    2.650094
                 2.Sex_Scr |   .1023051   .1628467    -1.43   0.152     .0045183    2.316428
      z_APACHEIII_baseline |   2.374786   .9220941     2.23   0.026      1.10947    5.083155
                z_Charlson |   1.634337   .5263278     1.53   0.127     .8693956    3.072314
          z_ref_Creatinine |   .7724476   .2853268    -0.70   0.485     .3745003    1.593258
                     _cons |   .1338258   .1065315    -2.53   0.012     .0281154    .6369944
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for AKD

Number of observations =       71
Area under ROC curve   =   0.9040

. 
. logit AKD z_PBR5_25 i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_APACHEIII
> _baseline z_Charlson z_ref_Creatinine, vce(robust) or

note: 72.hour != 0 predicts failure perfectly;
      72.hour omitted and 26 obs not used.

Iteration 0:  Log pseudolikelihood = -32.256682  
Iteration 1:  Log pseudolikelihood = -21.450094  
Iteration 2:  Log pseudolikelihood = -18.966075  
Iteration 3:  Log pseudolikelihood = -18.763034  
Iteration 4:  Log pseudolikelihood = -18.761422  
Iteration 5:  Log pseudolikelihood = -18.761422  

Logistic regression                                     Number of obs =     71
                                                        Wald chi2(8)  =  16.04
                                                        Prob > chi2   = 0.0418
Log pseudolikelihood = -18.761422                       Pseudo R2     = 0.4184

--------------------------------------------------------------------------------------------
                           |               Robust
                       AKD | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                 z_PBR5_25 |   1.787547   .8719398     1.19   0.234     .6871533     4.65009
                           |
                      hour |
                       24  |   .7646834   .5612353    -0.37   0.715     .1814457    3.222675
                       72  |          1  (empty)
                           |
z_X__24_hours_Total_Fluids |    3.12813   1.480622     2.41   0.016     1.237057    7.910059
       z_Age_At_Enrollment |    1.20643   .4350421     0.52   0.603     .5950541    2.445952
                 2.Sex_Scr |   .0757883   .1341923    -1.46   0.145     .0023575    2.436453
      z_APACHEIII_baseline |   2.518479   .9263502     2.51   0.012     1.224753    5.178791
                z_Charlson |   1.239606   .5279995     0.50   0.614     .5379248    2.856575
          z_ref_Creatinine |    1.01195   .4105146     0.03   0.977     .4569357    2.241111
                     _cons |   .1985063   .1296551    -2.48   0.013     .0551835    .7140681
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for AKD

Number of observations =       71
Area under ROC curve   =   0.8799

. 
. 
. /*
> E. Hypothesis: Glycocalyx denudation is associated with higher risk of 90-day mortality.
> */
. logit death_90days z_total_HS i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z
> _APACHEIII_baseline z_Charlson z_ref_Creatinine, vce(robust) or

Iteration 0:  Log pseudolikelihood =  -50.67626  
Iteration 1:  Log pseudolikelihood = -28.844546  
Iteration 2:  Log pseudolikelihood = -25.661092  
Iteration 3:  Log pseudolikelihood = -25.533182  
Iteration 4:  Log pseudolikelihood = -25.532983  
Iteration 5:  Log pseudolikelihood = -25.532983  

Logistic regression                                     Number of obs =     97
                                                        Wald chi2(9)  =  47.31
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -25.532983                       Pseudo R2     = 0.4962

--------------------------------------------------------------------------------------------
                           |               Robust
              death_90days | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                z_total_HS |   1.653687    .365024     2.28   0.023     1.072914    2.548837
                           |
                      hour |
                       24  |   1.225606   1.326184     0.19   0.851     .1469931    10.21892
                       72  |   .2764406   .2124313    -1.67   0.094     .0613048    1.246549
                           |
z_X__24_hours_Total_Fluids |   1.654515   .8036757     1.04   0.300     .6385605     4.28686
       z_Age_At_Enrollment |   1.079821   .6397436     0.13   0.897     .3381076    3.448649
                 2.Sex_Scr |   .4900316   .3748025    -0.93   0.351     .1094408    2.194163
      z_APACHEIII_baseline |   3.145131   1.309192     2.75   0.006      1.39097    7.111476
                z_Charlson |   3.464737   1.265381     3.40   0.001     1.693545    7.088326
          z_ref_Creatinine |   .8957679   .3479707    -0.28   0.777     .4183474    1.918024
                     _cons |   .1786011   .1058168    -2.91   0.004     .0559201    .5704275
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for death_90days

Number of observations =       97
Area under ROC curve   =   0.9323

. 
. logit death_90days z_PBR5_25 i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_
> APACHEIII_baseline z_Charlson z_ref_Creatinine, vce(robust) or

Iteration 0:  Log pseudolikelihood =  -50.67626  
Iteration 1:  Log pseudolikelihood = -29.907534  
Iteration 2:  Log pseudolikelihood = -27.067055  
Iteration 3:  Log pseudolikelihood = -26.989839  
Iteration 4:  Log pseudolikelihood =  -26.98963  
Iteration 5:  Log pseudolikelihood =  -26.98963  

Logistic regression                                     Number of obs =     97
                                                        Wald chi2(9)  =  35.57
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -26.98963                        Pseudo R2     = 0.4674

--------------------------------------------------------------------------------------------
                           |               Robust
              death_90days | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                 z_PBR5_25 |   1.159357   .5087064     0.34   0.736     .4905964    2.739745
                           |
                      hour |
                       24  |   1.814253   2.123832     0.51   0.611      .182915    17.99477
                       72  |   .2641325   .1884406    -1.87   0.062      .065245    1.069292
                           |
z_X__24_hours_Total_Fluids |   1.697839   .7324888     1.23   0.220     .7288993    3.954808
       z_Age_At_Enrollment |   1.029227   .6058614     0.05   0.961     .3246728    3.262696
                 2.Sex_Scr |   .4872209   .4083443    -0.86   0.391     .0942597    2.518406
      z_APACHEIII_baseline |   3.364412   1.521048     2.68   0.007     1.387017    8.160873
                z_Charlson |    3.41709   1.378451     3.05   0.002     1.549824    7.534084
          z_ref_Creatinine |   1.059911   .3259833     0.19   0.850     .5800643    1.936701
                     _cons |   .1951976   .1111986    -2.87   0.004       .06391    .5961835
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for death_90days

Number of observations =       97
Area under ROC curve   =   0.9279

. 
. 
. /*
> 3. Secondary mechanistic analyses
> A. Hypothesis: Glycocalyx denudation is associated with microvascular dysfunction.  
> */
. use "/Users/chenxinlei/Library/Mobile Documents/com~apple~CloudDocs/Projects/AKI/Data/VMI/VMI_C
> omplete_Data.dta", clear

. foreach var of varlist total_HS PBR5_25 X__24_hours_Total_Fluids Age_At_Enrollment APACHEIII_ba
> seline Charlson IL6Val ref_Creatinine SummaryPPV_Small SummaryPVD_Small MfiSmall_n DeBackerScor
> e HeteroIndexSmall {
  2.     egen z_`var' = std(`var')
  3. }
(33 missing values generated)

. 
. mixed z_SummaryPPV_Small z_total_HS i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex
> _Scr z_APACHEIII_baseline z_Charlson|| PatientID: , variance

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -128.77372  
Iteration 1:  Log likelihood = -128.63069  
Iteration 2:  Log likelihood = -128.63048  
Iteration 3:  Log likelihood = -128.63048  

Computing standard errors ...

Mixed-effects ML regression                          Number of obs    =     97
Group variable: PatientID                            Number of groups =     59
                                                     Obs per group:
                                                                  min =      1
                                                                  avg =    1.6
                                                                  max =      3
                                                     Wald chi2(8)     =  15.52
Log likelihood = -128.63048                          Prob > chi2      = 0.0498

--------------------------------------------------------------------------------------------
        z_SummaryPPV_Small | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                z_total_HS |  -.2741064   .0976485    -2.81   0.005    -.4654939   -.0827189
                           |
                      hour |
                       24  |   .1253837   .2367059     0.53   0.596    -.3385512    .5893186
                       72  |  -.2853649   .2002967    -1.42   0.154    -.6779392    .1072093
                           |
z_X__24_hours_Total_Fluids |   .0203101   .1085088     0.19   0.852    -.1923633    .2329835
       z_Age_At_Enrollment |   .1876383   .1266469     1.48   0.138    -.0605852    .4358617
                 2.Sex_Scr |   .5695052   .2405253     2.37   0.018     .0980842    1.040926
      z_APACHEIII_baseline |  -.0838266   .1147407    -0.73   0.465    -.3087142    .1410611
                z_Charlson |   .0870751   .1164053     0.75   0.454     -.141075    .3152253
                     _cons |  -.2188762   .1700826    -1.29   0.198    -.5522321    .1144796
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
PatientID: Identity          |
                  var(_cons) |   .2609159   .2225504      .0490299    1.388482
-----------------------------+------------------------------------------------
               var(Residual) |   .6055309   .1834694      .3343732    1.096582
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 1.41          Prob >= chibar2 = 0.1177

. 
. mixed z_SummaryPVD_Small z_total_HS i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex
> _Scr z_APACHEIII_baseline z_Charlson|| PatientID: , variance

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -128.94739  
Iteration 1:  Log likelihood = -128.88506  
Iteration 2:  Log likelihood = -128.88506  

Computing standard errors ...

Mixed-effects ML regression                          Number of obs    =     97
Group variable: PatientID                            Number of groups =     59
                                                     Obs per group:
                                                                  min =      1
                                                                  avg =    1.6
                                                                  max =      3
                                                     Wald chi2(8)     =  13.10
Log likelihood = -128.88506                          Prob > chi2      = 0.1085

--------------------------------------------------------------------------------------------
        z_SummaryPVD_Small | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                z_total_HS |  -.1801997    .097985    -1.84   0.066    -.3722467    .0118473
                           |
                      hour |
                       24  |   .3125333   .2352511     1.33   0.184    -.1485504    .7736169
                       72  |   -.230362   .1988195    -1.16   0.247     -.620041     .159317
                           |
z_X__24_hours_Total_Fluids |   .0481444   .1098362     0.44   0.661    -.1671306    .2634195
       z_Age_At_Enrollment |   .2925579   .1281386     2.28   0.022     .0414108    .5437049
                 2.Sex_Scr |    .500977   .2434026     2.06   0.040     .0239167    .9780373
      z_APACHEIII_baseline |  -.0621167   .1158407    -0.54   0.592    -.2891602    .1649269
                z_Charlson |  -.0110372   .1177523    -0.09   0.925    -.2418275    .2197531
                     _cons |   -.240346   .1715308    -1.40   0.161    -.5765401    .0958482
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
PatientID: Identity          |
                  var(_cons) |   .2857496   .1748618      .0861193    .9481357
-----------------------------+------------------------------------------------
               var(Residual) |    .591682   .1484158       .361889    .9673894
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 2.85          Prob >= chibar2 = 0.0457

. 
. mixed z_MfiSmall_n z_total_HS i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z
> _APACHEIII_baseline z_Charlson|| PatientID: , variance

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -133.81038  
Iteration 1:  Log likelihood = -133.77756  
Iteration 2:  Log likelihood = -133.77756  

Computing standard errors ...

Mixed-effects ML regression                          Number of obs    =     97
Group variable: PatientID                            Number of groups =     59
                                                     Obs per group:
                                                                  min =      1
                                                                  avg =    1.6
                                                                  max =      3
                                                     Wald chi2(8)     =   4.36
Log likelihood = -133.77756                          Prob > chi2      = 0.8231

--------------------------------------------------------------------------------------------
              z_MfiSmall_n | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                z_total_HS |   .0571816   .1033504     0.55   0.580    -.1453815    .2597448
                           |
                      hour |
                       24  |   .3144707   .2380034     1.32   0.186    -.1520073    .7809487
                       72  |   -.126818    .200259    -0.63   0.527    -.5193183    .2656824
                           |
z_X__24_hours_Total_Fluids |  -.0275176   .1201549    -0.23   0.819    -.2630168    .2079817
       z_Age_At_Enrollment |   .0229524   .1399459     0.16   0.870    -.2513366    .2972413
                 2.Sex_Scr |   .1046758   .2659513     0.39   0.694    -.4165792    .6259308
      z_APACHEIII_baseline |   .1046608   .1255017     0.83   0.404    -.1413182    .3506397
                z_Charlson |    .002161   .1284576     0.02   0.987    -.2496114    .2539333
                     _cons |  -.0744637   .1850904    -0.40   0.687    -.4372342    .2883068
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
PatientID: Identity          |
                  var(_cons) |   .4248129   .2213573      .1529896    1.179596
-----------------------------+------------------------------------------------
               var(Residual) |   .5811403    .158675      .3403049    .9924158
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 3.53          Prob >= chibar2 = 0.0301

. 
. mixed z_DeBackerScore z_total_HS i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Sc
> r z_APACHEIII_baseline z_Charlson|| PatientID: , variance

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -133.14736  
Iteration 1:  Log likelihood = -132.66138  
Iteration 2:  Log likelihood = -132.66086  
Iteration 3:  Log likelihood = -132.66086  

Computing standard errors ...

Mixed-effects ML regression                          Number of obs    =     97
Group variable: PatientID                            Number of groups =     59
                                                     Obs per group:
                                                                  min =      1
                                                                  avg =    1.6
                                                                  max =      3
                                                     Wald chi2(8)     =   9.04
Log likelihood = -132.66086                          Prob > chi2      = 0.3386

--------------------------------------------------------------------------------------------
           z_DeBackerScore | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                z_total_HS |  -.0595433   .1009178    -0.59   0.555    -.2573385    .1382518
                           |
                      hour |
                       24  |   .2859295   .2660139     1.07   0.282    -.2354482    .8073073
                       72  |   .0535254   .2291223     0.23   0.815     -.395546    .5025968
                           |
z_X__24_hours_Total_Fluids |   .0034201   .1024688     0.03   0.973     -.197415    .2042552
       z_Age_At_Enrollment |    .247949   .1203141     2.06   0.039     .0121378    .4837603
                 2.Sex_Scr |   .2121211   .2272864     0.93   0.351     -.233352    .6575942
      z_APACHEIII_baseline |  -.0316115   .1120516    -0.28   0.778    -.2512286    .1880056
                z_Charlson |  -.1880781   .1104173    -1.70   0.089    -.4044921    .0283359
                     _cons |  -.1684749   .1683805    -1.00   0.317    -.4984947    .1615448
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
PatientID: Identity          |
                  var(_cons) |   .0318675   .1829261      4.14e-07    2451.428
-----------------------------+------------------------------------------------
               var(Residual) |   .8711571   .2165238      .5352203    1.417948
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 0.03          Prob >= chibar2 = 0.4307

. 
. mixed z_HeteroIndexSmall z_total_HS i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex
> _Scr z_APACHEIII_baseline z_Charlson|| PatientID: , variance

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -133.49387  
Iteration 1:  Log likelihood = -133.43182  
Iteration 2:  Log likelihood = -133.43177  
Iteration 3:  Log likelihood = -133.43177  

Computing standard errors ...

Mixed-effects ML regression                          Number of obs    =     97
Group variable: PatientID                            Number of groups =     59
                                                     Obs per group:
                                                                  min =      1
                                                                  avg =    1.6
                                                                  max =      3
                                                     Wald chi2(8)     =   5.47
Log likelihood = -133.43177                          Prob > chi2      = 0.7062

--------------------------------------------------------------------------------------------
        z_HeteroIndexSmall | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                z_total_HS |  -.0647159   .1022789    -0.63   0.527    -.2651788    .1357469
                           |
                      hour |
                       24  |  -.1792028   .2563331    -0.70   0.484    -.6816065    .3232008
                       72  |   .2434577   .2180384     1.12   0.264    -.1838897     .670805
                           |
z_X__24_hours_Total_Fluids |   .0160357   .1100787     0.15   0.884    -.1997146     .231786
       z_Age_At_Enrollment |   .0041288   .1287153     0.03   0.974    -.2481486    .2564062
                 2.Sex_Scr |   .2474408   .2442011     1.01   0.311    -.2311846    .7260662
      z_APACHEIII_baseline |  -.0584151   .1176404    -0.50   0.620     -.288986    .1721559
                z_Charlson |   .0922565   .1183515     0.78   0.436    -.1397082    .3242212
                     _cons |   -.158491   .1751249    -0.91   0.365    -.5017295    .1847475
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
PatientID: Identity          |
                  var(_cons) |   .1945868   .1352766      .0498148    .7600953
-----------------------------+------------------------------------------------
               var(Residual) |   .7409914   .1514752      .4963734     1.10616
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 2.31          Prob >= chibar2 = 0.0641

. 
. 
. mixed z_SummaryPPV_Small z_PBR5_25 i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_
> Scr z_APACHEIII_baseline z_Charlson|| PatientID: , variance

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood =  -129.5096  
Iteration 1:  Log likelihood = -129.48734  
Iteration 2:  Log likelihood = -129.48734  

Computing standard errors ...

Mixed-effects ML regression                          Number of obs    =     97
Group variable: PatientID                            Number of groups =     59
                                                     Obs per group:
                                                                  min =      1
                                                                  avg =    1.6
                                                                  max =      3
                                                     Wald chi2(8)     =  12.74
Log likelihood = -129.48734                          Prob > chi2      = 0.1212

--------------------------------------------------------------------------------------------
        z_SummaryPPV_Small | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                 z_PBR5_25 |   .2782581   .1210674     2.30   0.022     .0409704    .5155458
                           |
                      hour |
                       24  |    .194821   .2217497     0.88   0.380    -.2398004    .6294424
                       72  |  -.2444191   .1842292    -1.33   0.185    -.6055018    .1166635
                           |
z_X__24_hours_Total_Fluids |  -.0843515   .1205183    -0.70   0.484    -.3205632    .1518601
       z_Age_At_Enrollment |   .2371207   .1389824     1.71   0.088    -.0352798    .5095212
                 2.Sex_Scr |   .4624472   .2700581     1.71   0.087    -.0668569    .9917514
      z_APACHEIII_baseline |  -.0706713   .1233901    -0.57   0.567    -.3125115    .1711689
                z_Charlson |  -.0802385   .1377806    -0.58   0.560    -.3502834    .1898065
                     _cons |  -.2137587   .1823563    -1.17   0.241    -.5711704     .143653
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
PatientID: Identity          |
                  var(_cons) |   .4730145   .2244328      .1866388    1.198801
-----------------------------+------------------------------------------------
               var(Residual) |   .4812775   .1402357      .2718758    .8519627
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 3.26          Prob >= chibar2 = 0.0356

. 
. mixed z_SummaryPVD_Small z_PBR5_25 i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_
> Scr z_APACHEIII_baseline z_Charlson|| PatientID: , variance

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -129.93481  
Iteration 1:  Log likelihood = -129.91162  
Iteration 2:  Log likelihood = -129.91162  

Computing standard errors ...

Mixed-effects ML regression                          Number of obs    =     97
Group variable: PatientID                            Number of groups =     59
                                                     Obs per group:
                                                                  min =      1
                                                                  avg =    1.6
                                                                  max =      3
                                                     Wald chi2(8)     =  10.61
Log likelihood = -129.91162                          Prob > chi2      = 0.2248

--------------------------------------------------------------------------------------------
        z_SummaryPVD_Small | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                 z_PBR5_25 |   .1215557   .1202546     1.01   0.312     -.114139    .3572504
                           |
                      hour |
                       24  |   .3322347   .2319714     1.43   0.152    -.1224209    .7868904
                       72  |  -.2043463    .193175    -1.06   0.290    -.5829624    .1742697
                           |
z_X__24_hours_Total_Fluids |   -.009829   .1168209    -0.08   0.933    -.2387938    .2191359
       z_Age_At_Enrollment |   .3130936   .1347311     2.32   0.020     .0490254    .5771617
                 2.Sex_Scr |   .4575438   .2617252     1.75   0.080    -.0554282    .9705158
      z_APACHEIII_baseline |  -.0606826   .1202918    -0.50   0.614    -.2964502     .175085
                z_Charlson |  -.0983721   .1338962    -0.73   0.463    -.3608038    .1640597
                     _cons |  -.2429408   .1784711    -1.36   0.173    -.5927377     .106856
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
PatientID: Identity          |
                  var(_cons) |   .3801405   .1848558      .1465614    .9859814
-----------------------------+------------------------------------------------
               var(Residual) |   .5443635    .137973      .3312422    .8946071
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 4.24          Prob >= chibar2 = 0.0197

. 
. mixed z_MfiSmall_n z_PBR5_25 i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_
> APACHEIII_baseline z_Charlson|| PatientID: , variance

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -131.98733  
Iteration 1:  Log likelihood = -131.94493  
Iteration 2:  Log likelihood = -131.94492  

Computing standard errors ...

Mixed-effects ML regression                          Number of obs    =     97
Group variable: PatientID                            Number of groups =     59
                                                     Obs per group:
                                                                  min =      1
                                                                  avg =    1.6
                                                                  max =      3
                                                     Wald chi2(8)     =   8.19
Log likelihood = -131.94492                          Prob > chi2      = 0.4153

--------------------------------------------------------------------------------------------
              z_MfiSmall_n | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                 z_PBR5_25 |   .2472644   .1225462     2.02   0.044     .0070783    .4874505
                           |
                      hour |
                       24  |   .4051577   .2383869     1.70   0.089    -.0620722    .8723875
                       72  |  -.1511628   .1986039    -0.76   0.447    -.5404194    .2380937
                           |
z_X__24_hours_Total_Fluids |  -.0710805   .1186121    -0.60   0.549     -.303556     .161395
       z_Age_At_Enrollment |   .0533567   .1367995     0.39   0.697    -.2147655    .3214788
                 2.Sex_Scr |  -.0261179   .2657169    -0.10   0.922    -.5469135    .4946777
      z_APACHEIII_baseline |   .1222086   .1222633     1.00   0.318    -.1174231    .3618402
                z_Charlson |  -.1056486   .1359922    -0.78   0.437    -.3721885    .1608912
                     _cons |   -.026078   .1815187    -0.14   0.886    -.3818481     .329692
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
PatientID: Identity          |
                  var(_cons) |   .3801914   .2130946      .1267389    1.140498
-----------------------------+------------------------------------------------
               var(Residual) |   .5782149   .1586098       .337751    .9898786
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 3.11          Prob >= chibar2 = 0.0388

. 
. mixed z_DeBackerScore z_PBR5_25 i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr
>  z_APACHEIII_baseline z_Charlson|| PatientID: , variance

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -132.29561  
Iteration 1:  Log likelihood = -131.78713  
Iteration 2:  Log likelihood =  -131.7865  
Iteration 3:  Log likelihood =  -131.7865  

Computing standard errors ...

Mixed-effects ML regression                          Number of obs    =     97
Group variable: PatientID                            Number of groups =     59
                                                     Obs per group:
                                                                  min =      1
                                                                  avg =    1.6
                                                                  max =      3
                                                     Wald chi2(8)     =  11.10
Log likelihood =  -131.7865                          Prob > chi2      = 0.1960

--------------------------------------------------------------------------------------------
           z_DeBackerScore | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                 z_PBR5_25 |  -.1670644   .1142341    -1.46   0.144     -.390959    .0568303
                           |
                      hour |
                       24  |   .2010747    .268675     0.75   0.454    -.3255187    .7276681
                       72  |   .0792936   .2275755     0.35   0.728    -.3667462    .5253335
                           |
z_X__24_hours_Total_Fluids |     .03609   .1037181     0.35   0.728    -.1671938    .2393738
       z_Age_At_Enrollment |   .2264358   .1196138     1.89   0.058    -.0080029    .4608746
                 2.Sex_Scr |   .2893857    .230139     1.26   0.209    -.1616785    .7404498
      z_APACHEIII_baseline |  -.0428735   .1105771    -0.39   0.698    -.2596007    .1738536
                z_Charlson |  -.1265008   .1182982    -1.07   0.285    -.3583611    .1053595
                     _cons |  -.1972219   .1675727    -1.18   0.239    -.5256583    .1312145
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
PatientID: Identity          |
                  var(_cons) |   .0183421   .1873089      3.72e-11     9034573
-----------------------------+------------------------------------------------
               var(Residual) |   .8682026   .2219116      .5260839    1.432805
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 0.01          Prob >= chibar2 = 0.4611

. 
. mixed z_HeteroIndexSmall z_PBR5_25 i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_
> Scr z_APACHEIII_baseline z_Charlson|| PatientID: , variance

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -131.95916  
Iteration 1:  Log likelihood = -131.90633  
Iteration 2:  Log likelihood = -131.90631  
Iteration 3:  Log likelihood = -131.90631  

Computing standard errors ...

Mixed-effects ML regression                          Number of obs    =     97
Group variable: PatientID                            Number of groups =     59
                                                     Obs per group:
                                                                  min =      1
                                                                  avg =    1.6
                                                                  max =      3
                                                     Wald chi2(8)     =   8.79
Log likelihood = -131.90631                          Prob > chi2      = 0.3606

--------------------------------------------------------------------------------------------
        z_HeteroIndexSmall | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                 z_PBR5_25 |  -.2232539   .1190643    -1.88   0.061    -.4566158    .0101079
                           |
                      hour |
                       24  |  -.2779922   .2543069    -1.09   0.274    -.7764246    .2204403
                       72  |   .2744621   .2131889     1.29   0.198    -.1433806    .6923047
                           |
z_X__24_hours_Total_Fluids |   .0567625    .111189     0.51   0.610     -.161164    .2746889
       z_Age_At_Enrollment |  -.0246822   .1282621    -0.19   0.847    -.2760713    .2267068
                 2.Sex_Scr |   .3571318    .248515     1.44   0.151    -.1299486    .8442122
      z_APACHEIII_baseline |  -.0749261   .1162251    -0.64   0.519    -.3027231     .152871
                z_Charlson |   .1806086   .1276195     1.42   0.157    -.0695211    .4307384
                     _cons |  -.2000533   .1740429    -1.15   0.250    -.5411712    .1410646
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
PatientID: Identity          |
                  var(_cons) |   .2012943   .1317525      .0558082    .7260483
-----------------------------+------------------------------------------------
               var(Residual) |    .707749    .144872      .4738527    1.057098
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 2.65          Prob >= chibar2 = 0.0518

. 
. /*
> B. Hypothesis: Glycocalyx denudation is associated with endothelial activation.  
> Glycocalyx denudation has to happen before Endothelial activation.
> â€¢     Endothelial activation definition:
> o       Ang 2
> o       ICAM
> o       VCAM
> o       E-selectin
> o       P-selectin
> o       VEGF
> */
. use "/Users/chenxinlei/Library/Mobile Documents/com~apple~CloudDocs/Projects/AKI/Data/VMI/VMI_C
> omplete_Data.dta", clear

. gen Ang_2Val_log = log(Ang_2Val)

. gen ICAMVal_log = log(ICAMVal)
(58 missing values generated)

. gen VCAMVal_log = log(VCAMVal)
(58 missing values generated)

. gen E_SelectinVal_log = log(E_SelectinVal)
(58 missing values generated)

. gen P_SelectinVal_log = log(P_SelectinVal)
(58 missing values generated)

. 
. foreach var of varlist total_HS PBR5_25 X__24_hours_Total_Fluids Age_At_Enrollment APACHEIII_ba
> seline Charlson IL6Val ref_Creatinine Ang_2Val_log ICAMVal_log VCAMVal_log E_SelectinVal_log P_
> SelectinVal_log VEGF {
  2.     egen z_`var' = std(`var')
  3. }
(33 missing values generated)
(58 missing values generated)
(58 missing values generated)
(58 missing values generated)
(58 missing values generated)

. 
. mixed z_Ang_2Val_log z_total_HS i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr
>  z_APACHEIII_baseline z_Charlson|| PatientID: , variance

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood =  -100.1826  
Iteration 1:  Log likelihood =  -100.1826  

Computing standard errors ...

Mixed-effects ML regression                          Number of obs    =     97
Group variable: PatientID                            Number of groups =     59
                                                     Obs per group:
                                                                  min =      1
                                                                  avg =    1.6
                                                                  max =      3
                                                     Wald chi2(8)     =  50.74
Log likelihood =  -100.1826                          Prob > chi2      = 0.0000

--------------------------------------------------------------------------------------------
            z_Ang_2Val_log | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                z_total_HS |   .2056715   .0709548     2.90   0.004     .0666027    .3447403
                           |
                      hour |
                       24  |   .1931699   .1271472     1.52   0.129    -.0560339    .4423737
                       72  |  -.4067784   .1056767    -3.85   0.000     -.613901   -.1996558
                           |
z_X__24_hours_Total_Fluids |  -.1713258   .1065298    -1.61   0.108    -.3801204    .0374687
       z_Age_At_Enrollment |   -.396065   .1235516    -3.21   0.001    -.6382216   -.1539084
                 2.Sex_Scr |  -.3449168   .2347165    -1.47   0.142    -.8049527    .1151192
      z_APACHEIII_baseline |   .1570774   .1080691     1.45   0.146    -.0547342     .368889
                z_Charlson |   .1866317   .1124551     1.66   0.097    -.0337761    .4070396
                     _cons |   .2650566   .1570331     1.69   0.091    -.0427226    .5728358
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
PatientID: Identity          |
                  var(_cons) |   .5533528   .1255461      .3547149    .8632267
-----------------------------+------------------------------------------------
               var(Residual) |   .1432766   .0336112      .0904675    .2269124
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 37.50         Prob >= chibar2 = 0.0000

. 
. mixed z_ICAMVal_log z_total_HS i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr 
> z_APACHEIII_baseline z_Charlson|| PatientID: , variance

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -31.943146  
Iteration 1:  Log likelihood = -31.943142  
Iteration 2:  Log likelihood = -31.943142  

Computing standard errors ...

Mixed-effects ML regression                          Number of obs    =     39
Group variable: PatientID                            Number of groups =     23
                                                     Obs per group:
                                                                  min =      1
                                                                  avg =    1.7
                                                                  max =      3
                                                     Wald chi2(8)     =  13.34
Log likelihood = -31.943142                          Prob > chi2      = 0.1006

--------------------------------------------------------------------------------------------
             z_ICAMVal_log | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                z_total_HS |   .1361022   .1559895     0.87   0.383    -.1696317    .4418361
                           |
                      hour |
                       24  |   .1677344   .1411015     1.19   0.235    -.1088194    .4442882
                       72  |   .0617474   .1138867     0.54   0.588    -.1614664    .2849613
                           |
z_X__24_hours_Total_Fluids |  -.4280194   .2151311    -1.99   0.047    -.8496686   -.0063702
       z_Age_At_Enrollment |  -.6109625   .2153347    -2.84   0.005    -1.033011   -.1889142
                 2.Sex_Scr |   -.510394   .3526447    -1.45   0.148    -1.201565    .1807769
      z_APACHEIII_baseline |   .2281005   .1503244     1.52   0.129    -.0665298    .5227309
                z_Charlson |  -.0382952   .1573016    -0.24   0.808    -.3466007    .2700102
                     _cons |  -.0042956   .2434577    -0.02   0.986     -.481464    .4728727
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
PatientID: Identity          |
                  var(_cons) |   .5110085   .1769972      .2591784    1.007529
-----------------------------+------------------------------------------------
               var(Residual) |   .0676529   .0257642      .0320718     .142708
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 15.60         Prob >= chibar2 = 0.0000

. 
. mixed z_VCAMVal_log z_total_HS i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr 
> z_APACHEIII_baseline z_Charlson|| PatientID: , variance

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -38.334995  
Iteration 1:  Log likelihood = -38.052916  
Iteration 2:  Log likelihood =  -38.05245  
Iteration 3:  Log likelihood = -38.052449  

Computing standard errors ...

Mixed-effects ML regression                          Number of obs    =     39
Group variable: PatientID                            Number of groups =     23
                                                     Obs per group:
                                                                  min =      1
                                                                  avg =    1.7
                                                                  max =      3
                                                     Wald chi2(8)     =  53.21
Log likelihood = -38.052449                          Prob > chi2      = 0.0000

--------------------------------------------------------------------------------------------
             z_VCAMVal_log | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                z_total_HS |   .6006916   .1686276     3.56   0.000     .2701876    .9311957
                           |
                      hour |
                       24  |   .4864333   .3030157     1.61   0.108    -.1074665    1.080333
                       72  |   .1673976   .2516374     0.67   0.506    -.3258025    .6605978
                           |
z_X__24_hours_Total_Fluids |  -.7562881   .1575252    -4.80   0.000    -1.065032   -.4475444
       z_Age_At_Enrollment |  -.1740663   .1416572    -1.23   0.219    -.4517094    .1035768
                 2.Sex_Scr |  -.5897864   .2331502    -2.53   0.011    -1.046753   -.1328204
      z_APACHEIII_baseline |   .3979322   .1128595     3.53   0.000     .1767317    .6191328
                z_Charlson |  -.1857451   .1070467    -1.74   0.083    -.3955529    .0240626
                     _cons |   .0202413   .1853744     0.11   0.913    -.3430858    .3835685
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
PatientID: Identity          |
                  var(_cons) |   7.60e-15   6.70e-11             0           .
-----------------------------+------------------------------------------------
               var(Residual) |   .4121082   .0933482       .264364    .6424215
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 0.00          Prob >= chibar2 = 1.0000

. 
. mixed z_E_SelectinVal_log z_total_HS i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Se
> x_Scr z_APACHEIII_baseline z_Charlson|| PatientID: , variance

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood =  -22.39608  
Iteration 1:  Log likelihood =  -22.39608  

Computing standard errors ...

Mixed-effects ML regression                          Number of obs    =     39
Group variable: PatientID                            Number of groups =     23
                                                     Obs per group:
                                                                  min =      1
                                                                  avg =    1.7
                                                                  max =      3
                                                     Wald chi2(8)     =  29.28
Log likelihood =  -22.39608                          Prob > chi2      = 0.0003

--------------------------------------------------------------------------------------------
       z_E_SelectinVal_log | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                z_total_HS |   .2362762   .1161151     2.03   0.042     .0086947    .4638576
                           |
                      hour |
                       24  |  -.1004732   .0992777    -1.01   0.312    -.2950539    .0941076
                       72  |  -.0657505   .0801396    -0.82   0.412    -.2228212    .0913203
                           |
z_X__24_hours_Total_Fluids |  -.4571999   .1797765    -2.54   0.011    -.8095552   -.1048445
       z_Age_At_Enrollment |  -.6050788   .1823976    -3.32   0.001    -.9625715    -.247586
                 2.Sex_Scr |  -.8949399   .2985825    -3.00   0.003    -1.480151   -.3097288
      z_APACHEIII_baseline |   .0718627   .1267143     0.57   0.571    -.1764928    .3202181
                z_Charlson |   -.268658   .1316362    -2.04   0.041    -.5266601   -.0106558
                     _cons |   .3144034   .2054776     1.53   0.126    -.0883253    .7171322
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
PatientID: Identity          |
                  var(_cons) |   .3765496   .1198125      .2018285    .7025254
-----------------------------+------------------------------------------------
               var(Residual) |   .0331864   .0119095      .0164245    .0670547
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 26.55         Prob >= chibar2 = 0.0000

. 
. mixed z_P_SelectinVal_log z_total_HS i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Se
> x_Scr z_APACHEIII_baseline z_Charlson|| PatientID: , variance

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -43.039709  
Iteration 1:  Log likelihood =  -43.03957  
Iteration 2:  Log likelihood =  -43.03957  

Computing standard errors ...

Mixed-effects ML regression                          Number of obs    =     39
Group variable: PatientID                            Number of groups =     23
                                                     Obs per group:
                                                                  min =      1
                                                                  avg =    1.7
                                                                  max =      3
                                                     Wald chi2(8)     =  13.39
Log likelihood =  -43.03957                          Prob > chi2      = 0.0992

--------------------------------------------------------------------------------------------
       z_P_SelectinVal_log | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                z_total_HS |   .1035699   .2147948     0.48   0.630    -.3174201    .5245599
                           |
                      hour |
                       24  |   .0436787   .2786767     0.16   0.875    -.5025177    .5898751
                       72  |   .2173853   .2248752     0.97   0.334    -.2233621    .6581326
                           |
z_X__24_hours_Total_Fluids |  -.3658394   .2208506    -1.66   0.098    -.7986986    .0670197
       z_Age_At_Enrollment |  -.5979247   .2075668    -2.88   0.004    -1.004748   -.1911012
                 2.Sex_Scr |  -.8408632   .3411746    -2.46   0.014    -1.509553   -.1721732
      z_APACHEIII_baseline |   .2814181   .1514647     1.86   0.063    -.0154473    .5782836
                z_Charlson |  -.1928537   .1585482    -1.22   0.224    -.5036026    .1178951
                     _cons |   .2536314   .2444945     1.04   0.300    -.2255691    .7328319
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
PatientID: Identity          |
                  var(_cons) |    .334829   .1647126      .1276707    .8781222
-----------------------------+------------------------------------------------
               var(Residual) |   .2877317   .0991039      .1464896    .5651563
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.53          Prob >= chibar2 = 0.0093

. 
. mixed z_VEGF z_total_HS i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_APACH
> EIII_baseline z_Charlson|| PatientID: , variance

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -113.58299  
Iteration 1:  Log likelihood = -113.58276  
Iteration 2:  Log likelihood = -113.58276  

Computing standard errors ...

Mixed-effects ML regression                          Number of obs    =     97
Group variable: PatientID                            Number of groups =     59
                                                     Obs per group:
                                                                  min =      1
                                                                  avg =    1.6
                                                                  max =      3
                                                     Wald chi2(8)     =  17.73
Log likelihood = -113.58276                          Prob > chi2      = 0.0233

--------------------------------------------------------------------------------------------
                 z_VEGFVal | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                z_total_HS |   .0924991   .0830926     1.11   0.266    -.0703594    .2553577
                           |
                      hour |
                       24  |  -.0485432   .1591374    -0.31   0.760    -.3604467    .2633603
                       72  |  -.3671268   .1325322    -2.77   0.006    -.6268852   -.1073684
                           |
z_X__24_hours_Total_Fluids |  -.0683124   .1147902    -0.60   0.552    -.2932972    .1566723
       z_Age_At_Enrollment |    .032279   .1331947     0.24   0.809    -.2287778    .2933359
                 2.Sex_Scr |  -.0114876   .2530888    -0.05   0.964    -.5075325    .4845573
      z_APACHEIII_baseline |   .2124356   .1170076     1.82   0.069    -.0168951    .4417663
                z_Charlson |   .1440571   .1215115     1.19   0.236     -.094101    .3822152
                     _cons |   .0562687   .1705345     0.33   0.741    -.2779728    .3905101
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
PatientID: Identity          |
                  var(_cons) |   .5951096   .1625992      .3483589     1.01664
-----------------------------+------------------------------------------------
               var(Residual) |   .2308327   .0592196      .1396123    .3816551
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 21.51         Prob >= chibar2 = 0.0000

. 
. 
. mixed z_Ang_2Val_log z_PBR5_25 i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr 
> z_APACHEIII_baseline z_Charlson|| PatientID: , variance

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -103.75313  
Iteration 1:  Log likelihood = -103.75313  

Computing standard errors ...

Mixed-effects ML regression                          Number of obs    =     97
Group variable: PatientID                            Number of groups =     59
                                                     Obs per group:
                                                                  min =      1
                                                                  avg =    1.6
                                                                  max =      3
                                                     Wald chi2(8)     =  40.99
Log likelihood = -103.75313                          Prob > chi2      = 0.0000

--------------------------------------------------------------------------------------------
            z_Ang_2Val_log | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                 z_PBR5_25 |   .0723678   .0918668     0.79   0.431    -.1076878    .2524235
                           |
                      hour |
                       24  |   .2434651   .1274933     1.91   0.056    -.0064173    .4933475
                       72  |  -.4235921   .1051525    -4.03   0.000    -.6296873   -.2174969
                           |
z_X__24_hours_Total_Fluids |  -.1544852   .1145969    -1.35   0.178     -.379091    .0701206
       z_Age_At_Enrollment |  -.3954649   .1323227    -2.99   0.003    -.6548127   -.1361171
                 2.Sex_Scr |  -.3918524   .2556482    -1.53   0.125    -.8929137    .1092089
      z_APACHEIII_baseline |   .1726659   .1154169     1.50   0.135     -.053547    .3988788
                z_Charlson |   .1957012    .127338     1.54   0.124    -.0538766     .445279
                     _cons |   .2965746    .167946     1.77   0.077    -.0325936    .6257427
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
PatientID: Identity          |
                  var(_cons) |   .6479151   .1407107      .4233101    .9916936
-----------------------------+------------------------------------------------
               var(Residual) |   .1407739   .0325488      .0894773    .2214784
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 42.26         Prob >= chibar2 = 0.0000

. 
. mixed z_ICAMVal_log z_PBR5_25 i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z
> _APACHEIII_baseline z_Charlson|| PatientID: , variance

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -31.380773  
Iteration 1:  Log likelihood = -31.380773  

Computing standard errors ...

Mixed-effects ML regression                          Number of obs    =     39
Group variable: PatientID                            Number of groups =     23
                                                     Obs per group:
                                                                  min =      1
                                                                  avg =    1.7
                                                                  max =      3
                                                     Wald chi2(8)     =  14.45
Log likelihood = -31.380773                          Prob > chi2      = 0.0708

--------------------------------------------------------------------------------------------
             z_ICAMVal_log | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                 z_PBR5_25 |   .1594773   .1171788     1.36   0.174    -.0701891    .3891436
                           |
                      hour |
                       24  |   .1902509    .135706     1.40   0.161     -.075728    .4562298
                       72  |   .0393468   .1097571     0.36   0.720    -.1757731    .2544668
                           |
z_X__24_hours_Total_Fluids |  -.4361912   .2103536    -2.07   0.038    -.8484767   -.0239057
       z_Age_At_Enrollment |  -.5912092   .2161464    -2.74   0.006    -1.014848     -.16757
                 2.Sex_Scr |  -.5488963   .3541394    -1.55   0.121    -1.242997     .145204
      z_APACHEIII_baseline |   .2239835   .1498446     1.49   0.135    -.0697066    .5176736
                z_Charlson |  -.0450163   .1540016    -0.29   0.770    -.3468538    .2568213
                     _cons |   .0224579    .244435     0.09   0.927     -.456626    .5015417
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
PatientID: Identity          |
                  var(_cons) |   .5154476   .1696614      .2704011    .9825634
-----------------------------+------------------------------------------------
               var(Residual) |   .0628926   .0228038      .0309007    .1280063
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 22.35         Prob >= chibar2 = 0.0000

. 
. mixed z_VCAMVal_log z_PBR5_25 i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z
> _APACHEIII_baseline z_Charlson|| PatientID: , variance

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -40.761942  
Iteration 1:  Log likelihood = -40.761309  
Iteration 2:  Log likelihood = -40.761309  

Computing standard errors ...

Mixed-effects ML regression                          Number of obs    =     39
Group variable: PatientID                            Number of groups =     23
                                                     Obs per group:
                                                                  min =      1
                                                                  avg =    1.7
                                                                  max =      3
                                                     Wald chi2(8)     =  17.08
Log likelihood = -40.761309                          Prob > chi2      = 0.0293

--------------------------------------------------------------------------------------------
             z_VCAMVal_log | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                 z_PBR5_25 |   .2505331   .1664342     1.51   0.132     -.075672    .5767382
                           |
                      hour |
                       24  |   .4411419   .2661742     1.66   0.097      -.08055    .9628338
                       72  |   .0662027    .214007     0.31   0.757    -.3532433    .4856486
                           |
z_X__24_hours_Total_Fluids |  -.5928303   .2039014    -2.91   0.004    -.9924698   -.1931908
       z_Age_At_Enrollment |  -.1125481   .1946626    -0.58   0.563    -.4940798    .2689836
                 2.Sex_Scr |  -.6046202   .3213212    -1.88   0.060    -1.234398    .0251578
      z_APACHEIII_baseline |   .3135714   .1413242     2.22   0.026      .036581    .5905618
                z_Charlson |  -.0862742   .1456045    -0.59   0.553    -.3716538    .1991055
                     _cons |   .0593731   .2312049     0.26   0.797    -.3937802    .5125263
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
PatientID: Identity          |
                  var(_cons) |   .2850068   .1546098      .0984232     .825302
-----------------------------+------------------------------------------------
               var(Residual) |   .2626938   .0949103      .1293939    .5333175
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 4.37          Prob >= chibar2 = 0.0183

. 
. mixed z_E_SelectinVal_log z_PBR5_25 i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex
> _Scr z_APACHEIII_baseline z_Charlson|| PatientID: , variance

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -24.200005  
Iteration 1:  Log likelihood = -24.200004  

Computing standard errors ...

Mixed-effects ML regression                          Number of obs    =     39
Group variable: PatientID                            Number of groups =     23
                                                     Obs per group:
                                                                  min =      1
                                                                  avg =    1.7
                                                                  max =      3
                                                     Wald chi2(8)     =  23.20
Log likelihood = -24.200004                          Prob > chi2      = 0.0031

--------------------------------------------------------------------------------------------
       z_E_SelectinVal_log | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                 z_PBR5_25 |   -.052802   .0925489    -0.57   0.568    -.2341945    .1285904
                           |
                      hour |
                       24  |  -.0814748   .1033635    -0.79   0.431    -.2840636    .1211139
                       72  |  -.0775728   .0836739    -0.93   0.354    -.2415706    .0864251
                           |
z_X__24_hours_Total_Fluids |  -.3326963    .185092    -1.80   0.072      -.69547    .0300774
       z_Age_At_Enrollment |  -.6161171   .1916447    -3.21   0.001    -.9917339   -.2405004
                 2.Sex_Scr |   -.884815   .3138391    -2.82   0.005    -1.499928   -.2697017
      z_APACHEIII_baseline |   .0472252   .1324867     0.36   0.722    -.2124439    .3068942
                z_Charlson |  -.1762358   .1356498    -1.30   0.194    -.4421046    .0896329
                     _cons |    .302804   .2160529     1.40   0.161     -.120652      .72626
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
PatientID: Identity          |
                  var(_cons) |   .4141311   .1325437      .2211611    .7754735
-----------------------------+------------------------------------------------
               var(Residual) |   .0362841   .0131205      .0178615    .0737082
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 25.59         Prob >= chibar2 = 0.0000

. 
. mixed z_P_SelectinVal_log z_PBR5_25 i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex
> _Scr z_APACHEIII_baseline z_Charlson|| PatientID: , variance

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -43.155594  
Iteration 1:  Log likelihood = -43.155239  
Iteration 2:  Log likelihood = -43.155239  

Computing standard errors ...

Mixed-effects ML regression                          Number of obs    =     39
Group variable: PatientID                            Number of groups =     23
                                                     Obs per group:
                                                                  min =      1
                                                                  avg =    1.7
                                                                  max =      3
                                                     Wald chi2(8)     =  13.14
Log likelihood = -43.155239                          Prob > chi2      = 0.1072

--------------------------------------------------------------------------------------------
       z_P_SelectinVal_log | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                 z_PBR5_25 |  -.0023049   .1770431    -0.01   0.990     -.349303    .3446932
                           |
                      hour |
                       24  |   .0519252   .2806766     0.19   0.853    -.4981909    .6020413
                       72  |    .208482   .2256667     0.92   0.356    -.2338167    .6507806
                           |
z_X__24_hours_Total_Fluids |  -.3237893   .2179671    -1.49   0.137    -.7509969    .1034183
       z_Age_At_Enrollment |  -.5983506   .2085949    -2.87   0.004    -1.007189   -.1895121
                 2.Sex_Scr |  -.8437668   .3442214    -2.45   0.014    -1.518428   -.1691052
      z_APACHEIII_baseline |   .2729808   .1511394     1.81   0.071    -.0232469    .5692085
                z_Charlson |   -.162885   .1558387    -1.05   0.296    -.4683233    .1425532
                     _cons |   .2521822   .2472304     1.02   0.308    -.2323806    .7367449
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
PatientID: Identity          |
                  var(_cons) |   .3335786   .1724962      .1210696    .9190973
-----------------------------+------------------------------------------------
               var(Residual) |   .2911049   .1034532      .1450603    .5841852
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 4.80          Prob >= chibar2 = 0.0142

. 
. mixed z_VEGF z_PBR5_25 i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_APACHE
> III_baseline z_Charlson|| PatientID: , variance

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -113.80179  
Iteration 1:  Log likelihood = -113.80179  

Computing standard errors ...

Mixed-effects ML regression                          Number of obs    =     97
Group variable: PatientID                            Number of groups =     59
                                                     Obs per group:
                                                                  min =      1
                                                                  avg =    1.6
                                                                  max =      3
                                                     Wald chi2(8)     =  17.30
Log likelihood = -113.80179                          Prob > chi2      = 0.0271

--------------------------------------------------------------------------------------------
                 z_VEGFVal | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                 z_PBR5_25 |  -.0749315   .1036879    -0.72   0.470    -.2781561    .1282931
                           |
                      hour |
                       24  |  -.0684078   .1537097    -0.45   0.656    -.3696732    .2328577
                       72  |  -.3776205   .1269366    -2.97   0.003    -.6264116   -.1288294
                           |
z_X__24_hours_Total_Fluids |  -.0379914   .1199082    -0.32   0.751    -.2730071    .1970244
       z_Age_At_Enrollment |   .0194605   .1383651     0.14   0.888    -.2517302    .2906511
                 2.Sex_Scr |   .0330656   .2679459     0.12   0.902    -.4920987    .5582298
      z_APACHEIII_baseline |    .209894   .1210376     1.73   0.083    -.0273354    .4471233
                z_Charlson |   .2040568   .1344432     1.52   0.129     -.059447    .4675606
                     _cons |   .0494324   .1766689     0.28   0.780    -.2968323    .3956971
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
PatientID: Identity          |
                  var(_cons) |   .6657203    .158269      .4177594    1.060858
-----------------------------+------------------------------------------------
               var(Residual) |   .2092934    .049439      .1317304    .3325257
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 27.11         Prob >= chibar2 = 0.0000

. 
. 
. 
. /*
> C. Hypothesis: Glycocalyx denudation is associated with increased platelet rolling and/or adhes
> ion.  
> */
. use "/Users/chenxinlei/Library/Mobile Documents/com~apple~CloudDocs/Projects/AKI/Data/VMI/VMI_C
> omplete_Data.dta", clear

. gen Adhered_log = log(Adhered)
(77 missing values generated)

. 
. foreach var of varlist total_HS PBR5_25 X__24_hours_Total_Fluids Age_At_Enrollment APACHEIII_ba
> seline Charlson IL6Val ref_Creatinine Adhered_log Rolling{
  2.     egen z_`var' = std(`var')
  3. }
(33 missing values generated)
(77 missing values generated)
(69 missing values generated)

. 
. regress z_Rolling z_total_HS z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_APACHEI
> II_baseline z_Charlson

      Source |       SS           df       MS      Number of obs   =        28
-------------+----------------------------------   F(6, 21)        =      1.42
       Model |  7.78193986         6  1.29698998   Prob > F        =    0.2546
    Residual |  19.2180599        21  .915145708   R-squared       =    0.2882
-------------+----------------------------------   Adj R-squared   =    0.0849
       Total |  26.9999997        27   .99999999   Root MSE        =    .95663

--------------------------------------------------------------------------------------------
                 z_Rolling | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                z_total_HS |  -.1246227    .179222    -0.70   0.494    -.4973353    .2480899
z_X__24_hours_Total_Fluids |   .1160761   .2189358     0.53   0.602    -.3392258     .571378
       z_Age_At_Enrollment |   .4529362   .2227063     2.03   0.055    -.0102068    .9160792
                 2.Sex_Scr |  -.0834221   .4168216    -0.20   0.843    -.9502501    .7834059
      z_APACHEIII_baseline |  -.2956797   .2160476    -1.37   0.186    -.7449754     .153616
                z_Charlson |   .2537338   .2047736     1.24   0.229    -.1721162    .6795839
                     _cons |  -.0608305   .2893988    -0.21   0.836    -.6626681    .5410072
--------------------------------------------------------------------------------------------

. 
. regress z_Adhered_log z_total_HS z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_APA
> CHEIII_baseline z_Charlson

      Source |       SS           df       MS      Number of obs   =        20
-------------+----------------------------------   F(6, 13)        =      0.45
       Model |  3.24479839         6  .540799732   Prob > F        =    0.8351
    Residual |  15.7552019        13  1.21193861   R-squared       =    0.1708
-------------+----------------------------------   Adj R-squared   =   -0.2119
       Total |  19.0000003        19  1.00000001   Root MSE        =    1.1009

--------------------------------------------------------------------------------------------
             z_Adhered_log | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                z_total_HS |  -.3839232   .2772749    -1.38   0.189    -.9829393    .2150929
z_X__24_hours_Total_Fluids |   .1333918   .2866052     0.47   0.649     -.485781    .7525647
       z_Age_At_Enrollment |   .2415184    .365007     0.66   0.520    -.5470313    1.030068
                 2.Sex_Scr |   .0422072   .5906948     0.07   0.944    -1.233911    1.318326
      z_APACHEIII_baseline |   -.003819   .2664724    -0.01   0.989    -.5794976    .5718595
                z_Charlson |   .0620534   .2736062     0.23   0.824    -.5290368    .6531437
                     _cons |  -.1125539    .396426    -0.28   0.781    -.9689803    .7438724
--------------------------------------------------------------------------------------------

. 
. 
. regress z_Rolling z_PBR5_25 z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_APACHEII
> I_baseline z_Charlson

      Source |       SS           df       MS      Number of obs   =        28
-------------+----------------------------------   F(6, 21)        =      1.53
       Model |  8.20765997         6  1.36794333   Prob > F        =    0.2175
    Residual |  18.7923398        21  .894873322   R-squared       =    0.3040
-------------+----------------------------------   Adj R-squared   =    0.1051
       Total |  26.9999997        27   .99999999   Root MSE        =    .94598

--------------------------------------------------------------------------------------------
                 z_Rolling | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                 z_PBR5_25 |   -.232198   .2357367    -0.98   0.336    -.7224393    .2580433
z_X__24_hours_Total_Fluids |   .1112495   .2156299     0.52   0.611    -.3371774    .5596763
       z_Age_At_Enrollment |   .3959386   .2208273     1.79   0.087    -.0632969     .855174
                 2.Sex_Scr |   .0287871   .4419643     0.07   0.949     -.890328    .9479022
      z_APACHEIII_baseline |  -.3595806   .2107504    -1.71   0.103    -.7978601    .0786989
                z_Charlson |   .3055802   .2127049     1.44   0.166    -.1367638    .7479243
                     _cons |  -.1236758   .2998077    -0.41   0.684    -.7471602    .4998085
--------------------------------------------------------------------------------------------

. 
. regress z_Adhered_log z_PBR5_25 z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_APAC
> HEIII_baseline z_Charlson

      Source |       SS           df       MS      Number of obs   =        20
-------------+----------------------------------   F(6, 13)        =      0.30
       Model |  2.33238699         6  .388731164   Prob > F        =    0.9242
    Residual |  16.6676133        13   1.2821241   R-squared       =    0.1228
-------------+----------------------------------   Adj R-squared   =   -0.2821
       Total |  19.0000003        19  1.00000001   Root MSE        =    1.1323

--------------------------------------------------------------------------------------------
             z_Adhered_log | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                 z_PBR5_25 |  -.3406896   .3247449    -1.05   0.313    -1.042258     .360879
z_X__24_hours_Total_Fluids |   .1752356    .293706     0.60   0.561    -.4592777    .8097489
       z_Age_At_Enrollment |   .1671148   .3715636     0.45   0.660    -.6355996    .9698293
                 2.Sex_Scr |   .1165084   .6702598     0.17   0.865      -1.3315    1.564517
      z_APACHEIII_baseline |  -.0658394   .2767731    -0.24   0.816    -.6637713    .5320925
                z_Charlson |   .0550768   .2856355     0.19   0.850    -.5620011    .6721547
                     _cons |  -.1617424   .4430498    -0.37   0.721    -1.118893    .7954085
--------------------------------------------------------------------------------------------

. 
. /*
> D. Hypothesis: Glycocalyx denudation is associated decreased platelet count.  
> */
. use "/Users/chenxinlei/Library/Mobile Documents/com~apple~CloudDocs/Projects/AKI/Data/VMI/VMI_C
> omplete_Data.dta", clear

. gen Platelet_Count_log = log(Platelet_Count)
(29 missing values generated)

. 
. foreach var of varlist total_HS PBR5_25 X__24_hours_Total_Fluids Age_At_Enrollment APACHEIII_ba
> seline Charlson IL6Val ref_Creatinine Platelet_Count_log{
  2.     egen z_`var' = std(`var')
  3. }
(33 missing values generated)
(29 missing values generated)

. 
. mixed z_Platelet_Count_log z_total_HS i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.S
> ex_Scr z_APACHEIII_baseline z_Charlson || PatientID: , variance

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -70.261088  
Iteration 1:  Log likelihood = -70.261075  
Iteration 2:  Log likelihood = -70.261075  

Computing standard errors ...

Mixed-effects ML regression                          Number of obs    =     68
Group variable: PatientID                            Number of groups =     44
                                                     Obs per group:
                                                                  min =      1
                                                                  avg =    1.5
                                                                  max =      3
                                                     Wald chi2(8)     =   9.99
Log likelihood = -70.261075                          Prob > chi2      = 0.2660

--------------------------------------------------------------------------------------------
      z_Platelet_Count_log | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                z_total_HS |   -.048923   .0848905    -0.58   0.564    -.2153054    .1174594
                           |
                      hour |
                       24  |  -.1509252   .1226329    -1.23   0.218    -.3912813     .089431
                       72  |  -.2586259   .1101287    -2.35   0.019    -.4744742   -.0427776
                           |
z_X__24_hours_Total_Fluids |  -.1438898   .1357747    -1.06   0.289    -.4100034    .1222238
       z_Age_At_Enrollment |   .0970272   .1791753     0.54   0.588    -.2541498    .4482043
                 2.Sex_Scr |  -.2515543   .3062462    -0.82   0.411    -.8517859    .3486772
      z_APACHEIII_baseline |  -.2333555   .1667126    -1.40   0.162    -.5601062    .0933952
                z_Charlson |  -.0172014   .1421806    -0.12   0.904    -.2958703    .2614675
                     _cons |   .3316043   .2169379     1.53   0.126    -.0935862    .7567948
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
PatientID: Identity          |
                  var(_cons) |   .7488409   .1810516      .4662186    1.202789
-----------------------------+------------------------------------------------
               var(Residual) |   .0876461   .0265183      .0484387    .1585888
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 41.84         Prob >= chibar2 = 0.0000

. estat icc

Residual intraclass correlation

------------------------------------------------------------------------------
                       Level |        ICC   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
                   PatientID |   .8952212   .0393664       .789623    .9510973
------------------------------------------------------------------------------

. 
. mixed z_Platelet_Count_log z_PBR5_25 i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Se
> x_Scr z_APACHEIII_baseline z_Charlson || PatientID: , variance

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -69.941064  
Iteration 1:  Log likelihood =  -69.94106  

Computing standard errors ...

Mixed-effects ML regression                          Number of obs    =     68
Group variable: PatientID                            Number of groups =     44
                                                     Obs per group:
                                                                  min =      1
                                                                  avg =    1.5
                                                                  max =      3
                                                     Wald chi2(8)     =  11.16
Log likelihood =  -69.94106                          Prob > chi2      = 0.1931

--------------------------------------------------------------------------------------------
      z_Platelet_Count_log | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                 z_PBR5_25 |   -.102077   .1042409    -0.98   0.327    -.3063854    .1022315
                           |
                      hour |
                       24  |  -.1840696   .1200662    -1.53   0.125    -.4193951    .0512559
                       72  |  -.2644012   .1053544    -2.51   0.012    -.4708921   -.0579104
                           |
z_X__24_hours_Total_Fluids |  -.1298476   .1394896    -0.93   0.352    -.4032423    .1435471
       z_Age_At_Enrollment |   .0798037   .1836546     0.43   0.664    -.2801528    .4397601
                 2.Sex_Scr |  -.2162439    .312141    -0.69   0.488    -.8280291    .3955412
      z_APACHEIII_baseline |  -.2550396   .1690819    -1.51   0.131     -.586434    .0763548
                z_Charlson |   .0280514    .154345     0.18   0.856    -.2744593     .330562
                     _cons |   .3320105   .2195227     1.51   0.130     -.098246     .762267
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
PatientID: Identity          |
                  var(_cons) |   .7849539   .1819628      .4983384    1.236414
-----------------------------+------------------------------------------------
               var(Residual) |   .0798472    .023182      .0451992    .1410551
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 44.78         Prob >= chibar2 = 0.0000

. estat icc

Residual intraclass correlation

------------------------------------------------------------------------------
                       Level |        ICC   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
                   PatientID |   .9076698   .0327034      .8206374    .9547975
------------------------------------------------------------------------------

. 
. /*
> E. Hypothesis: Glycocalyx denudation is associated with tubular dysfunction.
> â€¢     Tubular dysfunction measures as a continuous variable using: 
> o       TIMP2/IGFBP7
> o       Kim1
> o       NGAL
> */
. use "/Users/chenxinlei/Library/Mobile Documents/com~apple~CloudDocs/Projects/AKI/Data/VMI/VMI_C
> omplete_Data.dta", clear

. gen TIMP2_0_log = log(TIMP2_0)
(9 missing values generated)

. gen IGFBP7_0_log = log(IGFBP7_0)
(9 missing values generated)

. gen KIM1Val_log = log(KIM1Val)
(67 missing values generated)

. gen NGALVal_log = log(NGALVal)
(67 missing values generated)

. 
. foreach var of varlist total_HS PBR5_25 X__24_hours_Total_Fluids Age_At_Enrollment APACHEIII_ba
> seline Charlson IL6Val ref_Creatinine TIMP2_0_log IGFBP7_0_log KIM1Val_log NGALVal_log{
  2.     egen z_`var' = std(`var')
  3. }
(33 missing values generated)
(9 missing values generated)
(9 missing values generated)
(67 missing values generated)
(67 missing values generated)

. 
. regress z_TIMP2_0_log z_total_HS i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Sc
> r z_APACHEIII_baseline z_Charlson

      Source |       SS           df       MS      Number of obs   =        88
-------------+----------------------------------   F(8, 79)        =      3.74
       Model |  23.9171674         8  2.98964592   Prob > F        =    0.0009
    Residual |  63.0828345        79  .798516893   R-squared       =    0.2749
-------------+----------------------------------   Adj R-squared   =    0.2015
       Total |  87.0000019        87  1.00000002   Root MSE        =     .8936

--------------------------------------------------------------------------------------------
             z_TIMP2_0_log | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                z_total_HS |   .0712714    .109917     0.65   0.519    -.1475129    .2900556
                           |
                      hour |
                       24  |   .1878528   .2718644     0.69   0.492    -.3532798    .7289854
                       72  |   .0225262   .2284826     0.10   0.922     -.432257    .4773094
                           |
z_X__24_hours_Total_Fluids |   .1327252   .0990253     1.34   0.184    -.0643797    .3298302
       z_Age_At_Enrollment |   .0124641   .1164336     0.11   0.915    -.2192911    .2442193
                 2.Sex_Scr |  -.7210126   .2249191    -3.21   0.002    -1.168703   -.2733222
      z_APACHEIII_baseline |   .3006702   .1218354     2.47   0.016     .0581629    .5431774
                z_Charlson |  -.0647666   .1130942    -0.57   0.568     -.289875    .1603419
                     _cons |   .3497382   .1664524     2.10   0.039     .0184229    .6810535
--------------------------------------------------------------------------------------------

. 
. regress z_IGFBP7_0_log z_total_HS i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_S
> cr z_APACHEIII_baseline z_Charlson

      Source |       SS           df       MS      Number of obs   =        88
-------------+----------------------------------   F(8, 79)        =      4.77
       Model |  28.3337225         8  3.54171531   Prob > F        =    0.0001
    Residual |  58.6662807        79  .742611148   R-squared       =    0.3257
-------------+----------------------------------   Adj R-squared   =    0.2574
       Total |  87.0000032        87  1.00000004   Root MSE        =    .86175

--------------------------------------------------------------------------------------------
            z_IGFBP7_0_log | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                z_total_HS |  -.0510325   .1059994    -0.48   0.632    -.2620191     .159954
                           |
                      hour |
                       24  |   .2214248   .2621749     0.84   0.401    -.3004213    .7432708
                       72  |   .0722716   .2203392     0.33   0.744    -.3663027    .5108458
                           |
z_X__24_hours_Total_Fluids |   .0784868   .0954959     0.82   0.414    -.1115931    .2685667
       z_Age_At_Enrollment |   .0005806   .1122837     0.01   0.996    -.2229146    .2240758
                 2.Sex_Scr |  -1.027276   .2169028    -4.74   0.000    -1.459011   -.5955423
      z_APACHEIII_baseline |   .1621977    .117493     1.38   0.171    -.0716663    .3960617
                z_Charlson |  -.0367274   .1090634    -0.34   0.737    -.2538127     .180358
                     _cons |   .4852978   .1605199     3.02   0.003     .1657909    .8048046
--------------------------------------------------------------------------------------------

. 
. mixed z_KIM1Val_log z_total_HS i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr 
> z_APACHEIII_baseline z_Charlson

Mixed-effects ML regression                             Number of obs =     30
                                                        Wald chi2(8)  =  23.49
Log likelihood = -33.384301                             Prob > chi2   = 0.0028

--------------------------------------------------------------------------------------------
             z_KIM1Val_log | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                z_total_HS |   .3218964   .2507646     1.28   0.199    -.1695932     .813386
                           |
                      hour |
                       24  |  -.4109899   .3628888    -1.13   0.257    -1.122239    .3002591
                       72  |  -.4660599   .3203471    -1.45   0.146    -1.093929    .1618088
                           |
z_X__24_hours_Total_Fluids |  -.0553202   .2701589    -0.20   0.838    -.5848219    .4741815
       z_Age_At_Enrollment |   -.004592   .1765446    -0.03   0.979    -.3506131    .3414291
                 2.Sex_Scr |  -.9673378   .3167239    -3.05   0.002    -1.588105   -.3465704
      z_APACHEIII_baseline |  -.2853425   .2009281    -1.42   0.156    -.6791543    .1084694
                z_Charlson |   .2250155   .1447238     1.55   0.120    -.0586379    .5086689
                     _cons |   .5793799   .2659344     2.18   0.029      .058158    1.100602
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
               var(Residual) |   .5421259   .1399763      .3268292     .899248
------------------------------------------------------------------------------

. 
. mixed z_NGALVal_log z_total_HS i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr 
> z_APACHEIII_baseline z_Charlson

Mixed-effects ML regression                             Number of obs =     30
                                                        Wald chi2(8)  =   9.91
Log likelihood = -37.778603                             Prob > chi2   = 0.2715

--------------------------------------------------------------------------------------------
             z_NGALVal_log | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                z_total_HS |   .3692019   .2903222     1.27   0.203    -.1998191     .938223
                           |
                      hour |
                       24  |  -.0052502   .4201338    -0.01   0.990    -.8286973     .818197
                       72  |    .112856   .3708812     0.30   0.761    -.6140578    .8397698
                           |
z_X__24_hours_Total_Fluids |  -.1122106   .3127759    -0.36   0.720    -.7252401    .5008189
       z_Age_At_Enrollment |  -.5263489   .2043942    -2.58   0.010    -.9269541   -.1257437
                 2.Sex_Scr |  -.4817326   .3666864    -1.31   0.189    -1.200425    .2369596
      z_APACHEIII_baseline |   .0525608   .2326241     0.23   0.821    -.4033741    .5084956
                z_Charlson |  -.0032018   .1675537    -0.02   0.985    -.3316009    .3251974
                     _cons |   .2314054   .3078851     0.75   0.452    -.3720382    .8348491
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
               var(Residual) |    .726655   .1876215      .4380755    1.205334
------------------------------------------------------------------------------

. 
. 
. regress z_TIMP2_0_log z_PBR5_25 i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr
>  z_APACHEIII_baseline z_Charlson

      Source |       SS           df       MS      Number of obs   =        88
-------------+----------------------------------   F(8, 79)        =      4.36
       Model |  26.6279776         8   3.3284972   Prob > F        =    0.0002
    Residual |  60.3720243        79   .76420284   R-squared       =    0.3061
-------------+----------------------------------   Adj R-squared   =    0.2358
       Total |  87.0000019        87  1.00000002   Root MSE        =    .87419

--------------------------------------------------------------------------------------------
             z_TIMP2_0_log | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                 z_PBR5_25 |  -.2152589   .1078108    -2.00   0.049    -.4298509   -.0006669
                           |
                      hour |
                       24  |   .0820839   .2700925     0.30   0.762    -.4555218    .6196896
                       72  |   .0263978   .2219803     0.12   0.906    -.4154428    .4682385
                           |
z_X__24_hours_Total_Fluids |   .1929893    .100424     1.92   0.058    -.0068997    .3928782
       z_Age_At_Enrollment |  -.0121345   .1144841    -0.11   0.916    -.2400094    .2157404
                 2.Sex_Scr |  -.6251666   .2239752    -2.79   0.007    -1.070978   -.1793551
      z_APACHEIII_baseline |   .3031816   .1191948     2.54   0.013     .0659304    .5404328
                z_Charlson |   .0311985   .1153636     0.27   0.788     -.198427     .260824
                     _cons |   .3242224   .1633785     1.98   0.051    -.0009743    .6494192
--------------------------------------------------------------------------------------------

. 
. regress z_IGFBP7_0_log z_PBR5_25 i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Sc
> r z_APACHEIII_baseline z_Charlson

      Source |       SS           df       MS      Number of obs   =        88
-------------+----------------------------------   F(8, 79)        =      6.47
       Model |  34.4454212         8  4.30567765   Prob > F        =    0.0000
    Residual |   52.554582        79  .665247873   R-squared       =    0.3959
-------------+----------------------------------   Adj R-squared   =    0.3348
       Total |  87.0000032        87  1.00000004   Root MSE        =    .81563

--------------------------------------------------------------------------------------------
            z_IGFBP7_0_log | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                 z_PBR5_25 |  -.3091505   .1005888    -3.07   0.003    -.5093675   -.1089335
                           |
                      hour |
                       24  |   .0876436   .2519997     0.35   0.729    -.4139492    .5892364
                       72  |   .1185861   .2071104     0.57   0.569    -.2936568    .5308289
                           |
z_X__24_hours_Total_Fluids |   .1539013   .0936968     1.64   0.104    -.0325975    .3404002
       z_Age_At_Enrollment |  -.0506487   .1068151    -0.47   0.637    -.2632588    .1619614
                 2.Sex_Scr |  -.9078954   .2089716    -4.34   0.000    -1.323843   -.4919477
      z_APACHEIII_baseline |   .1655465   .1112102     1.49   0.141    -.0558119    .3869048
                z_Charlson |    .067559   .1076357     0.63   0.532    -.1466845    .2818024
                     _cons |   .4458013   .1524341     2.92   0.005     .1423887    .7492139
--------------------------------------------------------------------------------------------

. 
. mixed z_KIM1Val_log z_PBR5_25 i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z
> _APACHEIII_baseline z_Charlson

Mixed-effects ML regression                             Number of obs =     30
                                                        Wald chi2(8)  =  22.33
Log likelihood = -33.713306                             Prob > chi2   = 0.0043

--------------------------------------------------------------------------------------------
             z_KIM1Val_log | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                 z_PBR5_25 |   .2035973   .2076672     0.98   0.327    -.2034228    .6106175
                           |
                      hour |
                       24  |  -.2585389   .3907569    -0.66   0.508    -1.024408    .5073304
                       72  |  -.4706556   .3238477    -1.45   0.146    -1.105385    .1640742
                           |
z_X__24_hours_Total_Fluids |  -.1118148   .3086423    -0.36   0.717    -.7167425    .4931129
       z_Age_At_Enrollment |   .0673058    .180078     0.37   0.709    -.2856406    .4202522
                 2.Sex_Scr |  -.9946285   .3184276    -3.12   0.002    -1.618735   -.3705219
      z_APACHEIII_baseline |  -.2777666    .203003    -1.37   0.171    -.6756452    .1201119
                z_Charlson |   .2277806   .1467674     1.55   0.121    -.0598782    .5154393
                     _cons |   .4952439   .2855923     1.73   0.083    -.0645067    1.054995
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
               var(Residual) |   .5541481   .1430804       .334077    .9191896
------------------------------------------------------------------------------

. 
. mixed z_NGALVal_log z_PBR5_25 i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z
> _APACHEIII_baseline z_Charlson

Mixed-effects ML regression                             Number of obs =     30
                                                        Wald chi2(8)  =  12.72
Log likelihood = -36.757076                             Prob > chi2   = 0.1218

--------------------------------------------------------------------------------------------
             z_NGALVal_log | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                 z_PBR5_25 |  -.4507155   .2298428    -1.96   0.050    -.9011991   -.0002318
                           |
                      hour |
                       24  |  -.2764067   .4324836    -0.64   0.523    -1.124059    .5712457
                       72  |       .067   .3584296     0.19   0.852    -.6355091    .7695091
                           |
z_X__24_hours_Total_Fluids |   .3716102   .3416005     1.09   0.277    -.2979145    1.041135
       z_Age_At_Enrollment |  -.5654324   .1993075    -2.84   0.005     -.956068   -.1747968
                 2.Sex_Scr |  -.6413951   .3524307    -1.82   0.069    -1.332147    .0493564
      z_APACHEIII_baseline |    .069971   .2246806     0.31   0.755    -.3703949    .5103369
                z_Charlson |   .0756925   .1624398     0.47   0.641    -.2426838    .3940687
                     _cons |   .4533942   .3160892     1.43   0.151    -.1661292    1.072918
--------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
               var(Residual) |   .6788159   .1752695       .409235    1.125982
------------------------------------------------------------------------------

. 
. 
. 
. /*
> F. Hypothesis: A positive change in microvascular dysfunction is associated with decreased risk
>  of persistent AKI.
> The change to look at is 24h â€“ 6h/72h - 6h. Create this variable. The outcome could be pAKI or 
> renal recovery.
> */
. use "/Users/chenxinlei/Library/Mobile Documents/com~apple~CloudDocs/Projects/AKI/Data/VMI/VMI_C
> omplete_Data.dta", clear

. keep PatientID hour AKI Persistent_Severe_AKI AKI_Recovery_Total total_HS PBR5_25 X__24_hours_T
> otal_Fluids Age_At_Enrollment Sex_Scr APACHEIII_baseline Charlson IL6Val ref_Creatinine MfiSmal
> l_n HeteroIndexSmall SummaryTVD_Small SummaryPPV_Small SummaryPVD_Small DeBackerScore

. reshape wide total_HS PBR5_25 IL6Val MfiSmall_n HeteroIndexSmall SummaryTVD_Small SummaryPPV_Sm
> all SummaryPVD_Small DeBackerScore, i(PatientID) j(hour)
(j = 6 24 72)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations               97   ->   59          
Number of variables                  20   ->   37          
j variable (3 values)              hour   ->   (dropped)
xij variables:
                               total_HS   ->   total_HS6 total_HS24 total_HS72
                                PBR5_25   ->   PBR5_256 PBR5_2524 PBR5_2572
                                 IL6Val   ->   IL6Val6 IL6Val24 IL6Val72
                             MfiSmall_n   ->   MfiSmall_n6 MfiSmall_n24 MfiSmall_n72
                       HeteroIndexSmall   ->   HeteroIndexSmall6 HeteroIndexSmall24 HeteroIndexSm
> all72
                       SummaryTVD_Small   ->   SummaryTVD_Small6 SummaryTVD_Small24 SummaryTVD_Sm
> all72
                       SummaryPPV_Small   ->   SummaryPPV_Small6 SummaryPPV_Small24 SummaryPPV_Sm
> all72
                       SummaryPVD_Small   ->   SummaryPVD_Small6 SummaryPVD_Small24 SummaryPVD_Sm
> all72
                          DeBackerScore   ->   DeBackerScore6 DeBackerScore24 DeBackerScore72
-----------------------------------------------------------------------------

. 
. gen MfiSmall_n_diff_24_6 = MfiSmall_n24 - MfiSmall_n6
(44 missing values generated)

. gen HeteroIndexSmall_diff_24_6 = HeteroIndexSmall24 - HeteroIndexSmall6
(44 missing values generated)

. gen SummaryTVD_Small_diff_24_6 = SummaryTVD_Small24 - SummaryTVD_Small6
(44 missing values generated)

. gen SummaryPPV_Small_diff_24_6 = SummaryPPV_Small24 - SummaryPPV_Small6
(44 missing values generated)

. gen SummaryPVD_Small_diff_24_6 = SummaryPVD_Small24 - SummaryPVD_Small6
(44 missing values generated)

. gen DeBackerScore_diff_24_6 = DeBackerScore24 - DeBackerScore6
(44 missing values generated)

. 
. gen MfiSmall_n_diff_72_6 = MfiSmall_n72 - MfiSmall_n6
(36 missing values generated)

. gen HeteroIndexSmall_diff_72_6 = HeteroIndexSmall72 - HeteroIndexSmall6
(36 missing values generated)

. gen SummaryTVD_Small_diff_72_6 = SummaryTVD_Small72 - SummaryTVD_Small6
(36 missing values generated)

. gen SummaryPPV_Small_diff_72_6 = SummaryPPV_Small72 - SummaryPPV_Small6
(36 missing values generated)

. gen SummaryPVD_Small_diff_72_6 = SummaryPVD_Small72 - SummaryPVD_Small6
(36 missing values generated)

. gen DeBackerScore_diff_72_6 = DeBackerScore72 - DeBackerScore6
(36 missing values generated)

. 
. gen MfiSmall_n_diff = MfiSmall_n_diff_72_6
(36 missing values generated)

. gen HeteroIndexSmall_diff = HeteroIndexSmall_diff_72_6
(36 missing values generated)

. gen SummaryTVD_Small_diff = SummaryTVD_Small_diff_72_6
(36 missing values generated)

. gen SummaryPPV_Small_diff = SummaryPPV_Small_diff_72_6
(36 missing values generated)

. gen SummaryPVD_Small_diff = SummaryPVD_Small_diff_72_6
(36 missing values generated)

. gen DeBackerScore_diff = DeBackerScore_diff_72_6
(36 missing values generated)

. 
. replace MfiSmall_n_diff = MfiSmall_n_diff_24_6 if missing(MfiSmall_n_diff)
(6 real changes made)

. replace HeteroIndexSmall_diff = HeteroIndexSmall_diff_24_6 if missing(HeteroIndexSmall_diff)
(6 real changes made)

. replace SummaryTVD_Small_diff = SummaryTVD_Small_diff_24_6 if missing(SummaryTVD_Small_diff)
(6 real changes made)

. replace SummaryPPV_Small_diff = SummaryPPV_Small_diff_24_6 if missing(SummaryPPV_Small_diff)
(6 real changes made)

. replace SummaryPVD_Small_diff = SummaryPVD_Small_diff_24_6 if missing(SummaryPVD_Small_diff)
(6 real changes made)

. replace DeBackerScore_diff = DeBackerScore_diff_24_6 if missing(DeBackerScore_diff)
(6 real changes made)

. 
. foreach var of varlist X__24_hours_Total_Fluids Age_At_Enrollment APACHEIII_baseline Charlson r
> ef_Creatinine MfiSmall_n_diff HeteroIndexSmall_diff SummaryTVD_Small_diff SummaryPPV_Small_diff
>  SummaryPVD_Small_diff DeBackerScore_diff {
  2.     egen z_`var' = std(`var')
  3. }
(30 missing values generated)
(30 missing values generated)
(30 missing values generated)
(30 missing values generated)
(30 missing values generated)
(30 missing values generated)

. 
. logit AKI_Recovery_Total z_MfiSmall_n_diff z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex
> _Scr z_APACHEIII_baseline z_Charlson, vce(robust) or

Iteration 0:  Log pseudolikelihood = -19.248039  
Iteration 1:  Log pseudolikelihood = -13.711877  
Iteration 2:  Log pseudolikelihood = -13.016708  
Iteration 3:  Log pseudolikelihood = -12.997967  
Iteration 4:  Log pseudolikelihood = -12.997925  
Iteration 5:  Log pseudolikelihood = -12.997925  

Logistic regression                                     Number of obs =     29
                                                        Wald chi2(6)  =  15.10
                                                        Prob > chi2   = 0.0195
Log pseudolikelihood = -12.997925                       Pseudo R2     = 0.3247

--------------------------------------------------------------------------------------------
                           |               Robust
        AKI_Recovery_Total | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
         z_MfiSmall_n_diff |   .1231276    .104821    -2.46   0.014     .0232119    .6531308
z_X__24_hours_Total_Fluids |   .6538173   .2898255    -0.96   0.338      .274242    1.558759
       z_Age_At_Enrollment |   .6103646   .3576856    -0.84   0.400      .193539    1.924909
                 2.Sex_Scr |   .1460927   .1632145    -1.72   0.085     .0163556    1.304936
      z_APACHEIII_baseline |   1.552487   1.401461     0.49   0.626     .2646253    9.108037
                z_Charlson |   .3850155   .2282916    -1.61   0.107     .1204386    1.230809
                     _cons |   1.087045   .7980802     0.11   0.909     .2578204    4.583293
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for AKI_Recovery_Total

Number of observations =       29
Area under ROC curve   =   0.8535

. 
. logit AKI_Recovery_Total z_HeteroIndexSmall_diff z_X__24_hours_Total_Fluids z_Age_At_Enrollment
>  i.Sex_Scr z_APACHEIII_baseline z_Charlson, vce(robust) or

Iteration 0:  Log pseudolikelihood = -19.248039  
Iteration 1:  Log pseudolikelihood = -13.694337  
Iteration 2:  Log pseudolikelihood = -13.410846  
Iteration 3:  Log pseudolikelihood =  -13.40327  
Iteration 4:  Log pseudolikelihood = -13.403247  
Iteration 5:  Log pseudolikelihood = -13.403247  

Logistic regression                                     Number of obs =     29
                                                        Wald chi2(6)  =  12.85
                                                        Prob > chi2   = 0.0455
Log pseudolikelihood = -13.403247                       Pseudo R2     = 0.3037

--------------------------------------------------------------------------------------------
                           |               Robust
        AKI_Recovery_Total | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
   z_HeteroIndexSmall_diff |   5.902598   4.732011     2.21   0.027     1.226449    28.40775
z_X__24_hours_Total_Fluids |   .6410243   .2909452    -0.98   0.327      .263351    1.560321
       z_Age_At_Enrollment |    .687517   .3811743    -0.68   0.499      .231931    2.038018
                 2.Sex_Scr |   .1600287   .1708224    -1.72   0.086     .0197507    1.296618
      z_APACHEIII_baseline |   1.535519   1.241144     0.53   0.596     .3149475    7.486388
                z_Charlson |   .4780226   .2813989    -1.25   0.210     .1507888    1.515401
                     _cons |   1.247505   .8548992     0.32   0.747     .3256305     4.77925
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for AKI_Recovery_Total

Number of observations =       29
Area under ROC curve   =   0.8283

. 
. logit AKI_Recovery_Total z_SummaryTVD_Small_diff z_X__24_hours_Total_Fluids z_Age_At_Enrollment
>  i.Sex_Scr z_APACHEIII_baseline z_Charlson, vce(robust) or

Iteration 0:  Log pseudolikelihood = -19.248039  
Iteration 1:  Log pseudolikelihood = -16.489123  
Iteration 2:  Log pseudolikelihood = -16.373092  
Iteration 3:  Log pseudolikelihood = -16.372461  
Iteration 4:  Log pseudolikelihood =  -16.37246  

Logistic regression                                     Number of obs =     29
                                                        Wald chi2(6)  =   5.45
                                                        Prob > chi2   = 0.4878
Log pseudolikelihood = -16.37246                        Pseudo R2     = 0.1494

--------------------------------------------------------------------------------------------
                           |               Robust
        AKI_Recovery_Total | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
   z_SummaryTVD_Small_diff |   1.492364   .9604022     0.62   0.534     .4227554    5.268179
z_X__24_hours_Total_Fluids |   .7034138   .5605087    -0.44   0.659     .1475499     3.35338
       z_Age_At_Enrollment |   .6700634   .3559404    -0.75   0.451      .236567    1.897919
                 2.Sex_Scr |    .239314   .2580803    -1.33   0.185      .028908    1.981154
      z_APACHEIII_baseline |   3.618203   2.694198     1.73   0.084     .8407527    15.57104
                z_Charlson |   .3494576   .2504984    -1.47   0.142     .0857503    1.424142
                     _cons |   1.146888   .8554649     0.18   0.854     .2658328    4.948039
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for AKI_Recovery_Total

Number of observations =       29
Area under ROC curve   =   0.7374

. 
. logit AKI_Recovery_Total z_SummaryPPV_Small_diff z_X__24_hours_Total_Fluids z_Age_At_Enrollment
>  i.Sex_Scr z_APACHEIII_baseline z_Charlson, vce(robust) or

Iteration 0:  Log pseudolikelihood = -19.248039  
Iteration 1:  Log pseudolikelihood = -14.496769  
Iteration 2:  Log pseudolikelihood =  -14.34292  
Iteration 3:  Log pseudolikelihood = -14.341693  
Iteration 4:  Log pseudolikelihood = -14.341693  

Logistic regression                                     Number of obs =     29
                                                        Wald chi2(6)  =   4.74
                                                        Prob > chi2   = 0.5780
Log pseudolikelihood = -14.341693                       Pseudo R2     = 0.2549

--------------------------------------------------------------------------------------------
                           |               Robust
        AKI_Recovery_Total | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
   z_SummaryPPV_Small_diff |   .2939744   .2478298    -1.45   0.146     .0563274    1.534262
z_X__24_hours_Total_Fluids |   .6944279   .3774439    -0.67   0.502     .2393159    2.015035
       z_Age_At_Enrollment |   .9283713   .4930258    -0.14   0.889     .3278521    2.628847
                 2.Sex_Scr |   .1121688   .1684067    -1.46   0.145     .0059143    2.127353
      z_APACHEIII_baseline |   2.323226   1.798189     1.09   0.276     .5096326    10.59073
                z_Charlson |   .4047291   .3119841    -1.17   0.241     .0893344    1.833624
                     _cons |   1.618679   1.522704     0.51   0.609     .2561113     10.2304
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for AKI_Recovery_Total

Number of observations =       29
Area under ROC curve   =   0.8384

. 
. logit AKI_Recovery_Total z_SummaryPVD_Small_diff z_X__24_hours_Total_Fluids z_Age_At_Enrollment
>  i.Sex_Scr z_APACHEIII_baseline z_Charlson, vce(robust) or

Iteration 0:  Log pseudolikelihood = -19.248039  
Iteration 1:  Log pseudolikelihood = -16.407254  
Iteration 2:  Log pseudolikelihood = -16.352652  
Iteration 3:  Log pseudolikelihood = -16.352428  
Iteration 4:  Log pseudolikelihood = -16.352428  

Logistic regression                                     Number of obs =     29
                                                        Wald chi2(6)  =   4.81
                                                        Prob > chi2   = 0.5680
Log pseudolikelihood = -16.352428                       Pseudo R2     = 0.1504

--------------------------------------------------------------------------------------------
                           |               Robust
        AKI_Recovery_Total | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
   z_SummaryPVD_Small_diff |   .6944958    .408528    -0.62   0.535     .2192611    2.199772
z_X__24_hours_Total_Fluids |   .9019426   .5625203    -0.17   0.869     .2656468    3.062339
       z_Age_At_Enrollment |   .8429643   .4559769    -0.32   0.752     .2919958    2.433559
                 2.Sex_Scr |   .1339809   .1648365    -1.63   0.102     .0120174    1.493739
      z_APACHEIII_baseline |      3.124   2.166274     1.64   0.100     .8025326    12.16072
                z_Charlson |   .3733265   .2226719    -1.65   0.099     .1159809    1.201686
                     _cons |   1.698297   1.310601     0.69   0.493     .3742216    7.707232
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for AKI_Recovery_Total

Number of observations =       29
Area under ROC curve   =   0.7475

. 
. logit AKI_Recovery_Total z_DeBackerScore_diff z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.
> Sex_Scr z_APACHEIII_baseline z_Charlson, vce(robust) or

Iteration 0:  Log pseudolikelihood = -19.248039  
Iteration 1:  Log pseudolikelihood = -15.248962  
Iteration 2:  Log pseudolikelihood =  -14.95551  
Iteration 3:  Log pseudolikelihood = -14.951322  
Iteration 4:  Log pseudolikelihood =  -14.95132  
Iteration 5:  Log pseudolikelihood =  -14.95132  

Logistic regression                                     Number of obs =     29
                                                        Wald chi2(6)  =   7.84
                                                        Prob > chi2   = 0.2501
Log pseudolikelihood = -14.95132                        Pseudo R2     = 0.2232

--------------------------------------------------------------------------------------------
                           |               Robust
        AKI_Recovery_Total | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
      z_DeBackerScore_diff |   3.542969   2.182993     2.05   0.040     1.059013    11.85314
z_X__24_hours_Total_Fluids |   .4746814   .4397264    -0.80   0.421     .0772471    2.916904
       z_Age_At_Enrollment |   .4498206   .2681406    -1.34   0.180     .1398406    1.446923
                 2.Sex_Scr |   .4490687   .4951438    -0.73   0.468     .0517341    3.898063
      z_APACHEIII_baseline |   5.632302   5.480669     1.78   0.076      .836374      37.929
                z_Charlson |   .3250933   .2498373    -1.46   0.144     .0720861    1.466103
                     _cons |   .7035437   .5485089    -0.45   0.652      .152638    3.242796
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for AKI_Recovery_Total

Number of observations =       29
Area under ROC curve   =   0.7879

. 
. 
. logit AKI z_MfiSmall_n_diff z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_APACHEII
> I_baseline z_Charlson, vce(robust) or

Iteration 0:  Log pseudolikelihood = -19.945818  
Iteration 1:  Log pseudolikelihood = -14.721144  
Iteration 2:  Log pseudolikelihood = -14.261421  
Iteration 3:  Log pseudolikelihood = -14.252682  
Iteration 4:  Log pseudolikelihood = -14.252673  
Iteration 5:  Log pseudolikelihood = -14.252673  

Logistic regression                                     Number of obs =     29
                                                        Wald chi2(6)  =   9.09
                                                        Prob > chi2   = 0.1685
Log pseudolikelihood = -14.252673                       Pseudo R2     = 0.2854

--------------------------------------------------------------------------------------------
                           |               Robust
                       AKI | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
         z_MfiSmall_n_diff |   .1499306    .123685    -2.30   0.021     .0297641    .7552445
z_X__24_hours_Total_Fluids |   1.112131   .5489755     0.22   0.830      .422651    2.926377
       z_Age_At_Enrollment |   .8443843   .4576801    -0.31   0.755     .2918535    2.442955
                 2.Sex_Scr |   .2227147    .224676    -1.49   0.137     .0308355    1.608594
      z_APACHEIII_baseline |   1.343978   1.119564     0.35   0.723     .2626169    6.877996
                z_Charlson |   .6202412   .3411536    -0.87   0.385     .2110431    1.822847
                     _cons |    1.44565   1.018005     0.52   0.601     .3636299    5.747336
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for AKI

Number of observations =       29
Area under ROC curve   =   0.8269

. 
. logit AKI z_HeteroIndexSmall_diff z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_AP
> ACHEIII_baseline z_Charlson, vce(robust) or

Iteration 0:  Log pseudolikelihood = -19.945818  
Iteration 1:  Log pseudolikelihood = -15.598104  
Iteration 2:  Log pseudolikelihood = -15.492905  
Iteration 3:  Log pseudolikelihood = -15.492518  
Iteration 4:  Log pseudolikelihood = -15.492518  

Logistic regression                                     Number of obs =     29
                                                        Wald chi2(6)  =   9.46
                                                        Prob > chi2   = 0.1494
Log pseudolikelihood = -15.492518                       Pseudo R2     = 0.2233

--------------------------------------------------------------------------------------------
                           |               Robust
                       AKI | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
   z_HeteroIndexSmall_diff |   3.502147   1.932035     2.27   0.023      1.18782    10.32567
z_X__24_hours_Total_Fluids |   1.129226   .5020025     0.27   0.785     .4724716    2.698897
       z_Age_At_Enrollment |   .9058388   .4873444    -0.18   0.854     .3155742    2.600161
                 2.Sex_Scr |   .2466747   .2489399    -1.39   0.165     .0341277    1.782964
      z_APACHEIII_baseline |    1.43609   1.114087     0.47   0.641     .3139341    6.569389
                z_Charlson |   .7287898   .3807861    -0.61   0.545     .2617321    2.029306
                     _cons |   1.608584   1.071849     0.71   0.476     .4357751    5.937796
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for AKI

Number of observations =       29
Area under ROC curve   =   0.8029

. 
. logit AKI z_SummaryTVD_Small_diff z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_AP
> ACHEIII_baseline z_Charlson, vce(robust) or

Iteration 0:  Log pseudolikelihood = -19.945818  
Iteration 1:  Log pseudolikelihood = -17.081585  
Iteration 2:  Log pseudolikelihood = -17.029826  
Iteration 3:  Log pseudolikelihood = -17.029759  
Iteration 4:  Log pseudolikelihood = -17.029759  

Logistic regression                                     Number of obs =     29
                                                        Wald chi2(6)  =   5.95
                                                        Prob > chi2   = 0.4287
Log pseudolikelihood = -17.029759                       Pseudo R2     = 0.1462

--------------------------------------------------------------------------------------------
                           |               Robust
                       AKI | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
   z_SummaryTVD_Small_diff |   2.053358   .9971909     1.48   0.138     .7926621     5.31914
z_X__24_hours_Total_Fluids |   1.112412   .5810718     0.20   0.838     .3996115    3.096659
       z_Age_At_Enrollment |   .7737036   .4321397    -0.46   0.646     .2589105    2.312062
                 2.Sex_Scr |   .4283394   .4596513    -0.79   0.429     .0522833    3.509239
      z_APACHEIII_baseline |   2.999114   2.223651     1.48   0.139      .701264    12.82639
                z_Charlson |   .5279038   .2813338    -1.20   0.231     .1857493    1.500315
                     _cons |   1.300158   .9175191     0.37   0.710     .3260654    5.184269
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for AKI

Number of observations =       29
Area under ROC curve   =   0.7308

. 
. logit AKI z_SummaryPPV_Small_diff z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_AP
> ACHEIII_baseline z_Charlson, vce(robust) or

Iteration 0:  Log pseudolikelihood = -19.945818  
Iteration 1:  Log pseudolikelihood =  -16.30182  
Iteration 2:  Log pseudolikelihood =  -16.26798  
Iteration 3:  Log pseudolikelihood = -16.267952  
Iteration 4:  Log pseudolikelihood = -16.267952  

Logistic regression                                     Number of obs =     29
                                                        Wald chi2(6)  =   5.32
                                                        Prob > chi2   = 0.5040
Log pseudolikelihood = -16.267952                       Pseudo R2     = 0.1844

--------------------------------------------------------------------------------------------
                           |               Robust
                       AKI | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
   z_SummaryPPV_Small_diff |   .4008538   .2308081    -1.59   0.112     .1296796    1.239083
z_X__24_hours_Total_Fluids |   1.103083   .4622091     0.23   0.815     .4852227    2.507696
       z_Age_At_Enrollment |   1.105842   .5830381     0.19   0.849     .3934689    3.107964
                 2.Sex_Scr |   .1854137   .2417883    -1.29   0.196     .0143924    2.388631
      z_APACHEIII_baseline |   2.094995   1.551149     1.00   0.318     .4908481    8.941672
                z_Charlson |   .6329182   .3599344    -0.80   0.421     .2076241    1.929379
                     _cons |    1.96522    1.70837     0.78   0.437     .3576513    10.79848
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for AKI

Number of observations =       29
Area under ROC curve   =   0.8077

. 
. logit AKI z_SummaryPVD_Small_diff z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_AP
> ACHEIII_baseline z_Charlson, vce(robust) or

Iteration 0:  Log pseudolikelihood = -19.945818  
Iteration 1:  Log pseudolikelihood = -17.805853  
Iteration 2:  Log pseudolikelihood = -17.790969  
Iteration 3:  Log pseudolikelihood = -17.790957  
Iteration 4:  Log pseudolikelihood = -17.790957  

Logistic regression                                     Number of obs =     29
                                                        Wald chi2(6)  =   4.25
                                                        Prob > chi2   = 0.6423
Log pseudolikelihood = -17.790957                       Pseudo R2     = 0.1080

--------------------------------------------------------------------------------------------
                           |               Robust
                       AKI | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
   z_SummaryPVD_Small_diff |   .9735932   .4285551    -0.06   0.952     .4108626    2.307058
z_X__24_hours_Total_Fluids |   1.275368   .5779366     0.54   0.591     .5246998    3.099987
       z_Age_At_Enrollment |   .9657225   .5169618    -0.07   0.948     .3382166    2.757464
                 2.Sex_Scr |    .244293   .2665701    -1.29   0.196     .0287799    2.073641
      z_APACHEIII_baseline |   2.749506   1.941497     1.43   0.152     .6889688    10.97261
                z_Charlson |   .5212646   .2599961    -1.31   0.191     .1961084    1.385543
                     _cons |   1.822344   1.293028     0.85   0.398     .4535943    7.321382
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for AKI

Number of observations =       29
Area under ROC curve   =   0.7115

. 
. logit AKI z_DeBackerScore_diff z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_APACH
> EIII_baseline z_Charlson, vce(robust) or

Iteration 0:  Log pseudolikelihood = -19.945818  
Iteration 1:  Log pseudolikelihood = -16.023554  
Iteration 2:  Log pseudolikelihood = -15.960961  
Iteration 3:  Log pseudolikelihood = -15.960822  
Iteration 4:  Log pseudolikelihood = -15.960822  

Logistic regression                                     Number of obs =     29
                                                        Wald chi2(6)  =   6.93
                                                        Prob > chi2   = 0.3275
Log pseudolikelihood = -15.960822                       Pseudo R2     = 0.1998

--------------------------------------------------------------------------------------------
                           |               Robust
                       AKI | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
      z_DeBackerScore_diff |   3.442566   1.893358     2.25   0.025     1.171479    10.11649
z_X__24_hours_Total_Fluids |   .8952562    .484804    -0.20   0.838     .3097419    2.587585
       z_Age_At_Enrollment |   .6377662    .383678    -0.75   0.455     .1961469    2.073679
                 2.Sex_Scr |   .6749718   .7543818    -0.35   0.725     .0754989     6.03435
      z_APACHEIII_baseline |    3.60289   3.133621     1.47   0.141      .655114     19.8146
                z_Charlson |   .5349633   .2877264    -1.16   0.245      .186428    1.535101
                     _cons |    1.00395   .7488913     0.01   0.996     .2326822     4.33173
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for AKI

Number of observations =       29
Area under ROC curve   =   0.7692

. 
. 
. /*
> G. Hypothesis: If microvascular dysfunction is associated with AKI, persistent AKI or AKD.
> The way to set this up would be using PPV or MFI as predictors, and AKI, persistent AKI or AKD 
> as outcomes. 
> */
. 
. use "/Users/chenxinlei/Library/Mobile Documents/com~apple~CloudDocs/Projects/AKI/Data/VMI/VMI_C
> omplete_Data.dta", clear

. foreach var of varlist total_HS PBR5_25 X__24_hours_Total_Fluids Age_At_Enrollment APACHEIII_ba
> seline Charlson IL6Val ref_Creatinine SummaryPPV_Small SummaryPVD_Small MfiSmall_n DeBackerScor
> e HeteroIndexSmall {
  2.     egen z_`var' = std(`var')
  3. }
(33 missing values generated)

. 
. ** AKD
. logit AKD z_SummaryPPV_Small i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_
> APACHEIII_baseline z_Charlson, vce(robust) or

note: 72.hour != 0 predicts failure perfectly;
      72.hour omitted and 26 obs not used.

Iteration 0:  Log pseudolikelihood = -32.256682  
Iteration 1:  Log pseudolikelihood = -21.936971  
Iteration 2:  Log pseudolikelihood = -19.559285  
Iteration 3:  Log pseudolikelihood = -19.406338  
Iteration 4:  Log pseudolikelihood = -19.405934  
Iteration 5:  Log pseudolikelihood = -19.405934  

Logistic regression                                     Number of obs =     71
                                                        Wald chi2(7)  =  13.05
                                                        Prob > chi2   = 0.0708
Log pseudolikelihood = -19.405934                       Pseudo R2     = 0.3984

--------------------------------------------------------------------------------------------
                           |               Robust
                       AKD | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
        z_SummaryPPV_Small |   .8438409   .1840017    -0.78   0.436      .550369      1.2938
                           |
                      hour |
                       24  |   .5714788   .3619843    -0.88   0.377     .1651333    1.977723
                       72  |          1  (empty)
                           |
z_X__24_hours_Total_Fluids |   3.730917   1.895628     2.59   0.010     1.378262    10.09949
       z_Age_At_Enrollment |   1.134123   .3455116     0.41   0.680     .6242246    2.060532
                 2.Sex_Scr |   .1360179   .1778206    -1.53   0.127     .0104904    1.763596
      z_APACHEIII_baseline |   2.210949   .7133661     2.46   0.014     1.174728    4.161216
                z_Charlson |   1.628258   .5287255     1.50   0.133     .8616333    3.076976
                     _cons |    .163404   .1200818    -2.47   0.014     .0387021    .6899076
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for AKD

Number of observations =       71
Area under ROC curve   =   0.8785

. 
. logit AKD z_MfiSmall_n i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_APACHE
> III_baseline z_Charlson, vce(robust) or

note: 72.hour != 0 predicts failure perfectly;
      72.hour omitted and 26 obs not used.

Iteration 0:  Log pseudolikelihood = -32.256682  
Iteration 1:  Log pseudolikelihood = -21.912436  
Iteration 2:  Log pseudolikelihood = -19.579355  
Iteration 3:  Log pseudolikelihood = -19.427699  
Iteration 4:  Log pseudolikelihood =  -19.42729  
Iteration 5:  Log pseudolikelihood =  -19.42729  

Logistic regression                                     Number of obs =     71
                                                        Wald chi2(7)  =  13.89
                                                        Prob > chi2   = 0.0532
Log pseudolikelihood = -19.42729                        Pseudo R2     = 0.3977

--------------------------------------------------------------------------------------------
                           |               Robust
                       AKD | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
              z_MfiSmall_n |   1.281938   .5889566     0.54   0.589     .5209574    3.154509
                           |
                      hour |
                       24  |   .5693506   .3809159    -0.84   0.400     .1534247    2.112828
                       72  |          1  (empty)
                           |
z_X__24_hours_Total_Fluids |   3.445096   1.721772     2.48   0.013     1.293577    9.175091
       z_Age_At_Enrollment |   1.025735   .3333934     0.08   0.938     .5424628    1.939546
                 2.Sex_Scr |   .1115789   .1472004    -1.66   0.096     .0084069    1.480913
      z_APACHEIII_baseline |   2.274817   .7839798     2.38   0.017     1.157692    4.469919
                z_Charlson |   1.619437   .5464872     1.43   0.153     .8358378    3.137664
                     _cons |   .1783366    .124951    -2.46   0.014     .0451698    .7040968
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for AKD

Number of observations =       71
Area under ROC curve   =   0.8814

. 
. ** AKI vs No AKI
. logit AKI z_SummaryPPV_Small i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_
> APACHEIII_baseline z_Charlson, vce(robust) or

Iteration 0:  Log pseudolikelihood = -63.976977  
Iteration 1:  Log pseudolikelihood = -56.167717  
Iteration 2:  Log pseudolikelihood = -55.948531  
Iteration 3:  Log pseudolikelihood = -55.947655  
Iteration 4:  Log pseudolikelihood = -55.947655  

Logistic regression                                     Number of obs =     97
                                                        Wald chi2(8)  =  14.25
                                                        Prob > chi2   = 0.0754
Log pseudolikelihood = -55.947655                       Pseudo R2     = 0.1255

--------------------------------------------------------------------------------------------
                           |               Robust
                       AKI | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
        z_SummaryPPV_Small |   .8876781    .245832    -0.43   0.667     .5158521    1.527516
                           |
                      hour |
                       24  |   1.029441   .7110944     0.04   0.966     .2658441    3.986352
                       72  |   .7792948   .4078717    -0.48   0.634     .2793799    2.173744
                           |
z_X__24_hours_Total_Fluids |   1.400645   .3068873     1.54   0.124      .911646    2.151939
       z_Age_At_Enrollment |   .7951408   .2442968    -0.75   0.456     .4354349    1.451994
                 2.Sex_Scr |   .2040934   .1226066    -2.65   0.008     .0628753    .6624876
      z_APACHEIII_baseline |   1.698696   .4868977     1.85   0.065     .9685801    2.979174
                z_Charlson |   .6621805     .15224    -1.79   0.073     .4219676    1.039139
                     _cons |   4.432733    2.10138     3.14   0.002     1.750456    11.22514
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for AKI

Number of observations =       97
Area under ROC curve   =   0.7218

. 
. logit AKI z_MfiSmall_n i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment i.Sex_Scr z_APACHE
> III_baseline z_Charlson, vce(robust) or

Iteration 0:  Log pseudolikelihood = -63.976977  
Iteration 1:  Log pseudolikelihood = -56.184642  
Iteration 2:  Log pseudolikelihood = -56.003814  
Iteration 3:  Log pseudolikelihood = -56.003135  
Iteration 4:  Log pseudolikelihood = -56.003135  

Logistic regression                                     Number of obs =     97
                                                        Wald chi2(8)  =  13.63
                                                        Prob > chi2   = 0.0919
Log pseudolikelihood = -56.003135                       Pseudo R2     = 0.1246

--------------------------------------------------------------------------------------------
                           |               Robust
                       AKI | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
              z_MfiSmall_n |    1.05445   .2160188     0.26   0.796     .7057416    1.575457
                           |
                      hour |
                       24  |   .9811901   .6737121    -0.03   0.978     .2554434    3.768874
                       72  |   .8030123   .4200229    -0.42   0.675      .288067    2.238468
                           |
z_X__24_hours_Total_Fluids |   1.396462   .3012559     1.55   0.122     .9149581    2.131361
       z_Age_At_Enrollment |   .7830511   .2463775    -0.78   0.437     .4226393    1.450809
                 2.Sex_Scr |   .1956633    .116705    -2.74   0.006      .060786    .6298187
      z_APACHEIII_baseline |   1.709001   .4920255     1.86   0.063      .972029    3.004729
                z_Charlson |   .6719348   .1524909    -1.75   0.080     .4306783    1.048338
                     _cons |    4.50571   2.160757     3.14   0.002     1.760196    11.53361
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estat auc

Logistic model for AKI

Number of observations =       97
Area under ROC curve   =   0.7254

. 
. /*
> ** Persistent Severe AKI vs No Persistent Severe AKI among everyone
> gen X__24_hours_Total_Fluids_log = log(X__24_hours_Total_Fluids)
> egen z_X__24_hours_Total_Fluids_log = std(X__24_hours_Total_Fluids_log)
> gen Age_At_Enrollment_log = log(Age_At_Enrollment)
> egen z_Age_At_Enrollment_log = std(Age_At_Enrollment_log)
> gen APACHEIII_baseline_log = log(APACHEIII_baseline)
> egen z_APACHEIII_baseline_log = std(APACHEIII_baseline_log)
> gen SummaryPPV_Small_log = log(SummaryPPV_Small)
> egen z_SummaryPPV_Small_log = std(SummaryPPV_Small_log)
> 
> logit Persistent_Severe_AKI z_SummaryPPV_Small i.hour X__24_hours_Total_Fluids Age_At_Enrollmen
> t i.Sex_Scr APACHEIII_baseline Charlson, vce(robust) or
> estat auc
> 
> logit Persistent_Severe_AKI z_MfiSmall_n i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment 
> i.Sex_Scr z_APACHEIII_baseline z_Charlson, vce(robust) or
> estat auc
> 
> ** Persistent Severe AKI vs No Persistent Severe AKI among those with AKI
> keep if AKI == 1
> logit Persistent_Severe_AKI z_SummaryPPV_Small i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrol
> lment i.Sex_Scr z_APACHEIII_baseline z_Charlson, vce(robust) or
> estat auc
> 
> logit Persistent_Severe_AKI z_MfiSmall_n i.hour z_X__24_hours_Total_Fluids z_Age_At_Enrollment 
> i.Sex_Scr z_APACHEIII_baseline z_Charlson, vce(robust) or
> estat auc
> */
. log close
      name:  <unnamed>
       log:  /Users/chenxinlei/Library/Mobile Documents/com~apple~CloudDocs/Projects/AKI/Code/VMI
> /VMI.log
  log type:  text
 closed on:   5 Oct 2024, 17:19:47
-------------------------------------------------------------------------------------------------
